
{
    "document_name": "ib-collect-plus-2",
    "url": "https://indianbank.in/departments/ib-collect-plus-2/",
    "domain": "home",
    "class": "departments",
    "sub_class": "",
    "main_title": "IB Collect Plus",
    "subtitle": {
        "html_tag": "<h3>.*</h3>",
        "elements": [
            {
                "text":"A Free Online Fee Collection Software for institutions/corporate",
                "content":[
                    {
                        "text":"Indian Bank provides Free Online Fee Collection Software to Corporate, Institutions, Agencies, NGOs, Finance Companies, Government Departments etc. to collect money from Agents, Distributors, Students, Donors, Subscribers, Borrowers, Tax Payers etc."
                    }
                ]
            },
            {
                "text": "Key Features:",
                "content": [
                    {
                        "text": [
                            "Free of Cost Online Collection Software to facilitate Institutions/Departments which do not have website of their own.",
                            "Customization of Software with Institution’s own Logo and Branding to create a Look and Feel for the remitters",
                            "Multi-Mode Payment Facility(Debit Card, Credit Card, UPI, Wallets, Net Banking of any Bank)",
                            "User Friendly Admin Portal to create and manage the Master Data, to download reports, to initiate Refund or to raise any query anytime as per institutional requirement",
                            "Alerts/Reminders to Customers for Payments on time"
                        ]
                    }
                ]
            },
            {
                "text": "Target Segment:",
                "content": [
                    {
                        "text": [
                            "Educational institutions like Schools/ Colleges/Universities to collect fee payments",
                            "Corporate/Agencies to collect various payments from their clients/customers.",
                            "NGOs / Trusts / Societies/ Temples/Hospitals for collecting funds online.",
                            "Collection of Recurring Payments / Bill payments / Any Dues.",
                            "Newspaper / Periodicals who collect subscription",
                            "Chit Companies/ Jewelry collecting subscription",
                            "Residential Association for collection of charges",
                            "Finance companies collecting loan installments from borrowers.",
                            "Any other type of customer who collects money from multiple remitters at regular intervals"
                        ]
                    }
                ]
            },
            {
                "text": "How ib collect plus Works?",
                "content": [
                    {
                        "text": [
                            "Institution details will be configured in the IB Collect System of payment gateways and a portal access will be provided with username and password to the institution.",
                            "Institutions can update their logo,name, terms and conditions etc in the portal.",
                            "After customization, Institutions can upload the data master in the specified excel format and the amount they intend to collect in the system.",
                            "A URL link will be created for institution for the remitters to access and make payments.",
                            "Intending remitters can enter the login credentials as required by the institution and make payment.",
                            "Institution can view the transactions performed on real time basis through the Admin Dashboard provided to them."
                        ]
                    }
                ]
            },
            {
                "text": "Benefits to institution/Merchants:",
                "content": [
                    {
                        "text": [
                            "Free of Cost Online Collection Software to facilitate Institutions/Departments which do not have an Online Payment Facility in their website",
                            "Admin portal to create and manage the master data as per institutional requirement.",
                            "Facility to upload remitter data to create user logins and other payment details",
                            "Expand business by enabling multiple payment options to remitters ensuring flexible payments.",
                            "Monitoring transactions on real time basis for speedy service to remitters.",
                            "Download reports as per institutional convenience.",
                            "Manage refunds at ease using Admin Portal.",
                            "Configure alerts to customers for receiving payments on time"
                        ]
                    }
                ]
            },
            {
                "text": "Benefits to Remitters/End Users:",
                "content": [
                    {
                        "text": [
                            "Can Login and make payments at their own convenience.",
                            "Can make payments through flexible options such as Credit Card/Debit Card/Net banking/UPl/Wallets.",
                            "Receiving confirmation for payments made on real time basis.",
                            "Fast and Secure payment mechanism."
                        ]
                    }
                ]
            },
            {
                "text": "Additional Benefits:",
                "content": [
                    {
                        "text": [
                            "Instant Plug and Play module to avail online collection facility.",
                            "No Additional Cost for software / website development.",
                            "No Annual maintenance charges or any other hidden charges",
                            "Minimal transaction charges.",
                            "Training for easy access of admin portal"
                        ]
                    }
                ]
            }
        ]
    }
}
