{
    "url": "https://www.ujjivansfb.in/privacy-policy",
    "domain": "Home",
    "class": "Regulatory",
    "main_title": "Privacy Policy",
    "subtitle": {
        "elements": [
            {
                "text": "Privacy Policy",
                "content": [
                    {
                        "text": [
                            "Ujjivan Small Finance Bank (b-usb) believes in privacy of data provided by its customers/users (b-youb) and is committed to protect it. We take all necessary and reasonable measures to protect the customer information and its transmission through our online channels. This privacy policy will be applicable to customers/users that visit, use or interact with us through the online channels listed below.",
                            
                                "Our Website",
                                "Our Mobile Application",
                                "Our Internet Banking Page",
                                "Electronic communications ( E-mailers / SMS) from us",
                                "Digital Advertising Campaigns",
                                "Products and Services through the online lead forms and questionnaires.",
                    
                                "We request you to cooperate with us in order to ensure the security of your information. We encourage our customers to protect their confidential information by taking care of the following:",

                                "To not choose easy passwords.",
                                "To not share their MPIN, OTP (One Time Password) or any confidential information with anyone. Ujjivan Small Finance Bank will never ask for such information.",
                                "To not store any confidential information such as MPIN, debit card number, CVV number on their mobile device.",
                                "To not install applications on their mobile device from untrusted sources.",
                                "To not use a jail broken device to access their Mobile Banking application.",
                                "To not leave their mobile device unattended after logging into the Mobile Banking application.",
                                "To not use unsecured Wi-Fi or shared/public networks while accessing the Mobile Banking application."
                            
                        ]
                    }
                ]
            },
            {
                "text":"Collection and Disclosure of Information",
                "content": [
                    {
                        "text": [
                            "We limit the collection and use of customer information only on a need-to-know basis to offer better products and services to you. We may gather information such as device & phone number information to provide you with better services and for you to avail a range of offers. We may use the information for customer verification, provision of products and services, for personalization of products or services, marketing or promotion of our financial services or related products or that of our associates and affiliates or for any other purpose that will help us in providing you better services.",
                                
                            "We undertake not to disclose the information provided by you to any person, unless such action is necessary:",
                               
                                
                            "For us to provide you services or to enable the completion/compilation of a transaction, credit reporting, or the same is necessary or required pursuant to applicable banking norms or pursuant to the terms and conditions applicable to such information as agreed to with Ujjivan Small Finance Bank.",            
                                
                            "For the use of trusted third party/external organizations who assist us in our business operations and help us in providing services to the customers. We enter into strict confidentiality agreements (Non-Disclosure Agreements) with these third parties/external organizations which prohibit them for using customer's personal information for any other purpose other than providing the aforesaid functions to customers and the confidentiality norms as applicable to banks shall be adhered to by such third party/external organizations;",
                                
                            "For us to conform to legal requirements or comply with any legal or regulatory process or any Government/court/other relevant authority's directions/orders;",
                                
                            "For us to enforce the terms and conditions of the products or services availed by customers.",                 
                                 
                            "You shall not hold us liable for use or disclosure of information for the aforementioned purposes or in terms of any other agreements with you. Ujjivan Small Finance Bank is not responsible for any information practices employed by web sites linked with our web site. Generally, links to non-Ujjivan web sites are provided solely as pointers to information on topics that may be useful to users of Ujjivan's web site."
                            
                        ]
                    }
                ]
            },
            {
                "text":"Protection of Information:",
                "content": [
                    {
                        "text": [
                            "The information made available to us will be secure and inaccessible to any unauthorized party. The security of our customer's information is our paramount concern for which we have taken numerous safeguards. We ensure adequate physical, procedural and electronic protection of the customer's information. When the customer inputs any personal or other information, it gets collected through our server(s) in our database(s). Other information accessed by us is also safely collected in our database(s).Our database is password protected and access to which is available only after passing through the various safety controls."
                            
                        ]
                    }
                ]
            },
            {
                "text":"Additional Information:",
                "content": [
                    {
                        "text": [
                            "We may contact our customers from time to time in order to gauge the customer's overall experience in using our online channels. This process is for the improvement of the quality of our services as per the demands and requests of the customers.",
                            "We may also notify our customers through promotional alerts about our products and services."
                            
                        ]
                    }
                ]
            },
            {
                "text":"Cookie policy:",
                "content": [
                    {
                        "text": [
                            "Our Website may use cookies; however, cookies set by or on behalf of our Bank do not collect personal information about you, but only about your browser session. This non-personal information is not disclosed to third parties, unless otherwise indicated in this policy, and may be retained by us for the improvement of our website and customization purposes and shall be done in compliance with our internal policies for privacy and data safeguarding. Only the following types of cookies are used on our website:",                      
                                
                            "Session cookies (Tier 1) are sometimes used on Ujjivan Small Finance Bank sites to provide streamlined navigation and for basic Web metrics.",
                                
                            "Persistent cookies (Tier 2) may be used on some Ujjivan Small Finance Bank sites to allow you to create and save customized reports or preference settings for future visits.",                    
                              
                            "Ujjivansfb.in uses 3rd party vendor re-marketing tracking cookies, including the Google Adwords tracking cookie and Facebook pixel. This means we will continue to show ads to you across the internet, specifically on the Google Content Network (GCN) and Facebook social media website. As always we respect your privacy and are not collecting any identifiable information through the use of Google, Facebook, or any other 3rd party remarketing system.",

                            "The third-party vendors, including Google and Facebook, whose services we use will place cookies on web browsers in order to serve ads based on past visits to our website. Third party vendors, including Google and Facebook, use cookies to serve ads based on a user's prior visits to your website. This allows us to make special offers and continue to market our services to those who have shown interest in our service."
                            
                        ]
                    }
                ]
            },
            {
                "text":"Social Media Policy:",
                "content": [
                    {
                        "text": [
                            "Social media pages are public forums. Ujjivan Small Finance Bank's page is intended for publishing information on Ujjivan Small Finance Bank and its products and services. Ujjivan Small Finance Bank will not solicit any confidential information through its social media page, unless any User initiates interest in any financial products of Ujjivan Small Finance Bank Ltd.''The Users are encouraged to exercise caution and not post any confidential information or sensitive data such as banking credentials, card details, etc. on our social media pages. Ujjivan Small Finance Bank bears no responsibility for any consequences arising out of the User sharing confidential information on its social media page. Any such communications should be conveyed directly to''customercare@ujjivan.com.''Ujjivan Small Finance Bank does not engage in any direct financial transactions through its social media pages. Ujjivan Small Finance Bank is not responsible for the content of any ads appearing on its social media pages. Ujjivan Small Finance Bank does not condone inappropriate, threatening or defamatory remarks posted to its social media pages and reserves the right to delete any post on its social media pages at any time when deemed necessary. Ujjivan Small Finance Bank reminds its Users that they should keep their PCs/Laptops/Mobile Phones and other devices through which it access our social media pages, up-to-date with anti-virus protection software. Any questions or complaints posted to our social media pages shall be addressed by our customer care executives and will be forwarded to the appropriate department.'"
                        ]
                    }
                ]
            },
            {
                "text":"Change in Policy and Opt Out option:",
                "content": [
                    {
                        "text": [
                            "This Privacy Policy may be changed by us from time to time. Any change in the policy shall be published at''www.ujjivansfb.in''as and when it is made. Continued use of the website and/or of our other Online Channels shall be construed as consent to the changes or modifications to this Privacy Policy, if any. Customers are free to withdraw their consent given earlier to the Bank by notifying the Bank to that effect."
                        ]
                    }
                ]
            },
            {
                "text":"Contact Us:",
                "content": [
                    {
                        "text": [
                            "Should there be any query or grievance that you may have regarding this privacy policy or regarding usage of our online channels, you may contact us in the following manner:",
                            "'E-mail us at :'customercare@ujjivan.com''Call us at :'18002082121'"
                        ]
                    }
                ]
            }
        ]
    }
}