{
    "url": "https://www.ujjivansfb.in/career-awards",
    "domain": "Home",
    "class": "About Us",
    "main_title": "Awards",
    "subtitle": {
        "elements": [
            {
                "text":"Inclusive Finance India Awards, 2019",
                "content": [
                    {
                        "text": [
                            "Mr. Samit Ghosh, Former MD & CEO, Ujjivan Small Finance Bank, was conferred upon the prestigious Inclusive Finance India Awards, 2019 in the category of 'Contribution to advancing financial inclusion by an individual', for his exemplary contribution to the same."
                        ]
                    }
                ]
            },
            {
                "text":"Ranked #6 Amongst India's Best Companies To Work 2019",
                "content": [
                    {
                        "text": [
                            "We have been ranked No.6 amongst India's Best Companies To Work For 2019 as per a study conducted by Great Place to Work' Institute and Economic Times across 20 industries. Ujjivan has consistently featured among the top 25 Companies to Work For in India for nearly a decade now. We are also recognized as the Best in Banking, Financial Services and Insurance Industry (BFSI) and Best among all organizations with more than 10,000 employees for inspiring trust among our employees, for instilling pride in them, for creating an environment within the workplace that promotes camaraderie and for many other reasons that makes Ujjivan one of India's best companies to work for. We strongly believe this achievement was made possible because of our employees who carry the passion with purpose to serve the unserved and underserved."
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan is Ranked 19 among India's Best Companies To Work For 2018",
                "content": [
                    {
                        "text": [
                            "Ujjivan Small Finance Bank has featured among India's Best Companies To Work For. Ranked 19th in the List of 100 Best Companies for 2018, Ujjivan also received Recognition for being among the Best in the Industry (Best Workplaces in Small Finance Bank) from Great Place To Work Institute'Click hereto view listing http://www.greatplacetowork.in/best-work-places/best-companies-to-work-for-2018/The recognition & ranking were announced at a grand Award Ceremony held in Mumbai on 28, June, 2018, hosted by the Great Place To Work Institute, in partnership with The Economic Times. We are both proud & humbled by the recognition & we believe that this recognition received over the years has been possible only because of a great team of people at Ujjivan.",

                            "Being among the Top 100 Best Companies To Work For means that Ujjivan has excelled in the 5 dimensions of creating & sustaining a great workplace, viz., Credibility, Respect, Pride, Fairness & Camaraderie.",

                            "For the year 2018, Ujjivan is also Ranked No.18 in Asia's 25 Best Large Workplaces & is also featured amongst India's Best Workplaces in BFSI (Banking, Financial Services & Insurance) 2018.",

                            "Great Place To Work' Institute is a global research, consulting & training firm that helps organizations identify and sustain High Trust, High Performance CultureTM & also has conducted pioneering research on the characteristics of great workplaces for over 30 years, across 58 countries. Every year, the Institute partners with about 10,000 organizations around the world. This year, being the 11th year of the Study in India, the Institute studied about 600 organizations throughout India. From the 600 organisations that are surveyed and studied under a robust assessment process, a list of '100 Best Organisations To Work For', is published."
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan SFB wins 'Best IT Risk and Cyber Security Initiatives' by Indian Banking Association at IBA Technology Award",
                "content": [
                    {
                        "text": [
                            "Ujjivan Small Finance Bank was bestowed with IBA Technology Award, presented by Indian Banking Association (IBA), on 23, February, 2018 in Mumbai. Ujjivan SFB was adjudged the winner in 'Best IT Risk and Cyber Security Initiatives''' amongst all Small Banks. The award was for the steps undertaken by Ujjivan to strengthen the Cyber risk framework as a part of enterprise risk management and initiatives related to IT Risk and Cyber Security.",

                            "The IBA awards are renowned innovation excellence awards in the country. As the focus on banks to constantly innovate and stay ahead of competition gets sharper, there is a renewed search to acquire and deploy the most innovative people, technologies, Cyber Security and Risk Management Practices.",

                            "The IBA Banking Technology Innovation Awards are most sought after, and have set hitherto unmatched industry standards. These awards recognize anks who have recorded noteworthy technology and business benefits in the previous year.",

                            "The Banking Technology Innovation Awards recognize and reward Banks identifying themselves in technology segment of Banking Industry- whose innovative ideas, initiative, risk leadership of qualities, implementation of various initiatives have kept their organizations ahead of their competitors.",

                            "The Awards Committee consisted of an eminent jury of present and former Deputy Governor of Reserve Bank of India, NPCI CEO and heads of other reputed organizations. There were 6 separate categories of awards and Ujjivan SFB was adjudged the Winner in 'Best IT Risk and Cyber Security Initiatives' amongst all Small Banks."
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan has once again been ranked as one of India's Best Companies To Work For!",
                "content": [
                    {
                        "text": [
                            "Ranked 13 on India's Best Companies to Work For List, Ujjivan Small Finance Bank, also received the recognition for 'Being the Best in the Industry - Small Finance Bank'.Click here to see the listing.The recognition & ranking were announced at a grand Award Ceremony at Mumbai on 30, June, 2017. hosted by the Great Place To Work Institute & Economic Times.",

                            "We are both proud & humbled by the recognition & we believe that this recognition received over the years has been possible because of our People-first-approach. We believe that every Great Place To Work also has a Great Team behind it."
                        ]
                    }
                ]
            },
            {
                "text": "Ujjivan stands proudly at No. 10 in the Best Large Workplaces in Asia List!",
                "content": [
                    {
                        "text": [
                            "We are both Proud and Humbled to be Ranked No.10 amongst Asia's Best Workplaces.",                
                            "Here are a few facts we take pride in:",
                             
                            "We feature in the category of 'Best Large Workplaces in Asia.'",
                            "Click here to see:",
                            "We are the Highest Ranked Indian Organization on this list!",
                            "This is what the Great Place To Work Institute says about this study:",
                             
                            "The Best Workplaces in Asia list recognises organisations in the Asia region that are dedicated to sustaining high-trust cultures for their employees. These workplaces are distinguished by their extraordinary levels of trust, pride, and camaraderie. Putting their people first is a key priority for these companies and it is this commitment to providing strong, caring, and innovative cultures that we celebrate with our Best Workplaces in Asia list."
                            
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan continues to be a Great Place to Work!",
                "content": [
                    {
                        "text": [
                            "Ujjivan Small Finance Bank is now certified as a Great Place to Work. Being Great Place to Work-Certified,despite challenges such as our transition, demonetization etc.is a great accomplishment!",

                            "Ujjivan is listed among the top companies, in the exclusive section dedicated for Great Place to Work-Certified' organizations.",

                            "We are one of the few Organizations in which 70% or more of employee respondents rate us as a great workplace! In our case, we have gone ahead by a very good margin ' 95% of Ujjivanites(surveyed) say we are a Great Place to Work!",

                            "On a 5 point Scale, our people practices are rated above the regular standards - at 3.0. Ujjivan features in the top quadrant 'Best Cultures', in the assessment of cultures.",
                            "In the following months, we will also be informed of our India-specific Ranking and our Asia-specific ranking in the list of Great Places to Work.",

                            "Great Place to Work' Institute has conducted pioneering research on the characteristics of great workplaces for over 25 years and is considered the gold standard for assessing & certifying great workplace cultures. Great Place To Work' partners with more than 8000 organizations every year around the world to help create and sustain a High-Trust, High-Performance Culture'.",

                            "As a part of the India's Best Companies to Work 2016 study, about 800 organizations across industries, employee strengths and revenue brackets are assessed. Over 155,119 employees were surveyed in the country, making it the largest survey of workplace cultures in corporate India. As a part of this program, organizations, including Ujjivan, were studied under two dimensions. First being a unique employee'centric framework that measures the levels of Trust, Pride and Camaraderie prevailing in an organization. Second being a People Practices assessment through a questionnaire seeking to understand the people practices, philosophy and values of an organization."   
                        ]
                    }
                ]
            },
            {
                "text":"SKOCH AWARD",
                "content": [
                    {
                        "text": [
                            "The Platinum Award is the highest independent honor given for Inclusive Insurance and was presented to Ujjivan after taking into consideration multiple factors, including the company's financial inclusion initiatives, exceptional customer service, insurance penetration and for covering the highest number of lives through insurance. The award assumes strategic significance for Ujjivan since penetrating into a segment (economically active poor women) hardly aware about insurance, its benefits or affordability is never an easy task. Ujjivan 's focus on Education (through its Common Group Training and Financial Literacy program, Assured Reach and Access, backed by a 100 % claim settlement ratio were the key factors instrumental for it winning this award.",

                            "Ujjivan was also awarded the SKOCH Order-of-Merit for qualifying amongst the Top 100 Projects in India. The Order-of-Merit award is bestowed on the top private and public organizations, recognizing them for their best practices and governance models towards efficient implementation of social programs and service deliveries."
                        ]
                    }
                ]
            },
            {
                "text": "3rd Best Place to Work For in India and #1 in Microfinance",
                "content": [
                    {
                        "text": [
                            "For the past seven years, Ujjivan has been consistently ranked among the Top 25 Companies to Work For in India. This year, Ujjivan has once again emerged as a top Indian company across industries, among global giants including Google (1st Rank) and Amex (2nd Rank) by becoming the 3rd Best Place to Work in India as per the survey conducted by the Great Place to Work Institute in coordination with the Economic Times.",

                            "Ujjivan continues its successful track record as the #1 company in the MFI domain and excels as an organization, where employees perceive their work to be not just career investments but also, as an opportunity that helps them contribute to the society."
                        ]
                    }
                ]
            },
            {
                "text":"PR Council of India- Chanakya Awards 2016",
                "content": [
                    {
                        "text": [
                            "Ujjivan received the PR Council of India- Chanakya Awards 2016 in the category- Corporate Citizen of the Year 2016 - for Outstanding contribution to the Profession, Industry and Society at the PRCI 10th Global Communication Conclave at Kolkata."
                        ]
                    }
                ]
            },
            {
                "text":"Entrepreneur of the year",
                "content": [
                    {
                        "text": [
                            "The Forbes India Leadership Awards (FILA) was held on the evening of 30, September, 2015 at the Grand Hyatt hotel in Mumbai. The awards recognize and honor outstanding business leaders from a wide spectrum of Indian entrepreneurs.",

                            "Samit Ghosh won the Entrepreneur with Social Impact. This award was for \"setting up an institution that provides financial access to approximately 2.6 million of India's Urban and Semi-urban working poor, a majority of them women\", and for providing \"financial services to the wither to unbanked population in rural areas"
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan is consistently among the top 25 companies to work for in India and number 1 in microfinance.",
                "content": [
                    {
                        "text": [
                            "Ujjivan has been ranked as one of the top 25 Best Companies to Work For, by Great Place To Work in India. Further, ranked as no. 1 in the MFI domain, Ujjivan's people practices create a sense of purpose in making a difference to the lives of their customers. Employees take pride in the work they do ' for them, this is not just a job, but they perceive it as a long-term career investment. They see this as an opportunity to make a difference and contribute to the well ' being of the society.",
                            "This is indeed a great moment for all UJJIVANITES who have made this possible. This achievement brings forth another great moment of rejoice as we accomplish yet another Milestone of serving over 2 million borrowers and Rs.3000+ crore of portfolio outstanding. This is only to reiterate the fact that in Ujjivan, winning is a habit. Kudos to team Ujjivan for making this happen.We hope that the future brings many more such accomplishments."
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan Awarded Innovator in Responsible Business Award by Inc. India Magazine",
                "content": [
                    {
                        "text": [
                            "Inc. India launched the Innovative100 last year to identify and recognize innovative mid-sized companies in India. Much like last year, winning companies this year too are those that have demonstrated a fresh and smart approach of looking at business problems and providing fascinating case studies of managing and growing companies in India. ' Ujjivan won it in responsible business category second year in a row."
                        ]
                    }
                ]
            },
            {
                "text": "Ujjivan - 16th Best Place to Work in Asia",
                "content": [
                    {
                        "text": [
                            "Ujjivan has been ranked the 16th Great Place to work in Asia and is proudly positioned 2ndamong the Indian companies. This for sure is another feather in the cap of our being in the 9thposition 2014 in India's Best Companies to Work For."
                        ]
                    }
                ]
            },
            {
                "text":"The Inspiring Work Places Awards 2014 in BFSI was organized by Banking Frontiers a monthly magazine published by Glocal Infomart Pvt Ltd. Launched in 2002. The awards types were :",
                "content": [
                    {
                        "text": [
                            "The Forbes India Leadership Awards (FILA) was held on the evening of 30, September, 2015 at the Grand Hyatt hotel in Mumbai. The awards recognize and honor outstanding business leaders from a wide spectrum of Indian entrepreneurs.",
                            
                            "Best HR and Talent Practice",
                            "Star HR Practitioner",
                            "HR Technology",
                            "Inspiring Place to Work",

                            "These awards were conferred for achievements in Public sector banks, Private banks, Insurance companies and NBFC's.",

                            "Ujjivan was awarded as the Most Inspiring Place to Work in the NBFC space."
                            
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan ranked #9 in overall ,#2 in Financial Services Industry as Best Company to Work For.",
                "content": [
                    {
                        "text": [
                            "It is a matter of pride for Ujjivan to get this recognition 2 years in a row. This year only 5 organizations managed to retain their position in Top 10(Underlined below) and only two of them are Indian Companies, and Ujjivan is one of them. Along with this Ujjivan has maintained its consistency in the financial services industry, as it continues to retain its 2nd position.",

                             "Read more about it on Economic Times: http://articles.economictimes.indiatimes.com/2014-06-30/news/50974516_1_ujjivan-financial-samit-ghosh-microfinance"
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan Awarded Innovator in Responsible Business Award by Inc. India Magazine",
                "content": [
                    {
                        "text": [
                            "Inc India*,flagship publication of9.9 Media,recently announced its first list ofIndia's 100 Most Innovative Mid-Sized Companies.There were total10 categories:Innovation in Branding and Communication, Innovation in Technology, Innovation in Responsible Business, Innovation in Product, Innovation in Manufacturing, Innovation in Marketing, Innovation in People Practices, Innovation in Corporate Governance, Innovation in Supply Chain and Innovation in Smart Money. Ujjivan was adjudged winner under the 'Innovation in Responsible Business' category."
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan ranked #7 in overall ,#2 in Financial Services Industry as Best Company to Work For, #2 in Rewards & Recognition Practice,#3in Engaging the Field Force",
                "content": [
                    {
                        "text": [
                            "It was a Proud event for Ujjivan Team to be Ranked 7th this year, among the India's Top 10 Best Employers to Work For in 2013. The CEO, Mr Samit Ghosh and the HR Team were felicitated in the award event on Friday, 21, June, 2013 in Mumbai in the presence of over 60 CEOs and over 300 HR Chiefs.",
                            "Ujjivan Progress year-on-year:",
                            "Over the past 5 years, Ujjivan has progressed from the initial rank of being Best Employer in Microfinance Industry to being among the India's Top 25 Best Employers for the last 3 years consecutively.",

                            "Ujjivan vs the Top 50 Employers in India:",
                            "Ujjivan Trust Index Grand Mean has progressed from 80 in its first year of participation to 90 in 2013. Corresponding Index of India's Top 50 remained in the range of 82.",

                            "There is no individual dimension where Ujjivan has shown a negative trend year on year. Even in the lowest scores of Top 50 Best Employers, Ujjivan remained higher by over 10 index points, confirming its belief in its people practices.",

                            "Recognition of Best Practices:",

                            "Ujjivan has been progressing each year from being at 100th Rank overall to 7th Rank this year. Ujjivan also retained its position as 2nd Best in the Financial Services Industry. Other Special Category Awards that we received were:",
                            
                            "2nd Best in Rewards and Recognition Practice (after Intel)",
                            "3rd Best in Engaging the Field Force;",
                                
                            "Overall, Ujjivan believes that Happy Employees lead to Happy Customers. The repayment rate of 99.73% is a testimonial of its belief of building the right institution with the 'Employee First, Customer Second' approach. It is the 'U', 'I' and 'V' that makes Ujjivan today.",

                            "Read more on Economic Times:http://economictimes.indiatimes.com/news/news-by-company/corporate-trends/best-companies-to-work-for-2013-what-makes-ujjivan-financial-services-a-coveted-employer/articleshow/20727827.cms"
                            
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan ranked 2nd in Financial Services industry among best companies to work for Ranked #3 in the leadership development",
                "content": [
                    {
                        "text": [
                            "Ujjivan continued to be ranked among India's Best 25 Companies to Work for, across industry sectors. This year, it was also ranked #2 in the financial services industry. As recognition of its talent management policies, Ujjivan was also ranked 3rd in Leadership Development this year.",

                            "The 2012 survey was conducted across companies in India spanning various sectors and sizes, and including domestic players as well as MNCs. 514 companies met the strict eligibility criteria for the survey, which is based on best practices and employee feedback. A total of 80,000 employees across 21 sectors participated. The results give a first-hand feel of workplace culture from an employee perspective. The most essential measure of whether a company is a great workplace is whether employees say it is.",
                            "Top ranked companies in the survey were chosen based on criteria such as flexible working hours, fun at work, systematic career development, and work-life balance."
                        ]
                    }
                ]
            },
            {
                "text": "Ujjivan wins Microfinance Organisation of the Year 2011 award",
                "content": [
                    {
                        "text": [
                            "Ujjivan received the prestigious 'Microfinance Organisation of the Year' award in the alrge institutions category. The award was presented at a special function organised at the Microfinance India Summit in Delhi.",

                            "The awards are an industry benchmark to recognise the contribution of notable thought leaders, promoters and institutions which helped to translate the vision of reaching the poorest in a sustainable manner into reality. It is based on evaluation of MFIs on a variety of parameters such as governance, portfolio quality, product innovation, credit plus services and social performance."
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan among India's top 25 best companies to work for Ranked #1 in the microfinance industry",
                "content": [
                    {
                        "text": [
                            "For the second time, Ujjivan ranked #1 in the Microfinance Industry as the Best Company to Work for, in 2011. What's more, this year Ujjivan also ranked among India's Best 25 Companies to Work for, across industry sectors.",

                            "The 2011 survey was conducted based on best practices and employee feedback by the Great Place to Work' Institute (India), in collaboration with The Economic Times, across companies in India, spanning various sectors and sizes, and including domestic players as well as MNCs. 67,000 employees in nearly 500 companies across 20 sectors were surveyed. The results give a first-hand feel of workplace culture from an employee perspective.",

                            "Top ranked companies in the survey were chosen based on criteria such as flexible working hours, fun at work, systematic career development, and work-life balance."
                        ]
                    }
                ]
            },
            {
                "text": "Ujjivan wins Gold Social Performance Reporting Award for the second year November 2010",
                "content": [
                    {
                        "text": [
                            "Ujjivan was presented with the Gold Social Performance Reporting Award in 2010. This is the second consecutive year that we have won the award.",

                            "The Social Performance Reporting award is launched by CGAP, together with partners, Michael and Susan Dell Foundation, Ford Foundation, and the Social Performance Task Force (SPTF). Social Performance Management' the process of ensuring that an MFI acts in a socially responsible manner ' is a critical factor in the measurement of the overall performance of an MFI. This award is a result of Ujjivan's continuing emphasis on social performance as part of its operations, despite the financial crisis in late 2010 in India."
                        ]
                    }
                ]
            },
            {
                "text": "Ujjivan wins MFI Transparency Award October 2010",
                "content": [
                    {
                        "text": [
                            "Ujjivan won the Srijan MFI Transparency Award 2010 in the Established MFI category from among a host of other large MFIs from around the country.",

                            "The Srijan 2010 MFI Transparency Award, instituted by Intellecap and supported by an eminent jury of experts, recognizes initiatives and practices within MFIs that enable them to be transparent and eventually fairer to their clients. The award jury comprising eminent industry experts from banking and investment, evaluated MFIs on the following criteria:",
                            
                            "Transparency in pricing and product design",
                            "Financial literacy initiatives promoting transparency with clients",
                            "Effectiveness of communication and reporting mechanisms",
                            "Organizational systems and innovative practices that promote transparency",

                            "Top ranked companies in the survey were chosen based on criteria such as flexible working hours, fun at work, systematic career development, and work-life balance."
                            
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan wins Social Performance Reporting Award October 2009",
                "content": [
                    {
                        "text": [
                            "Ujjivan was presented with the 2009 Social Performance Reporting Award ' category Gold. The social Performance Reporting awards were launched by CGAP, together with its partners the Michael and Susan Dell Foundation, the Ford Foundation, and the Social Performance Task Force (SPTF). The award, powered by MIX, is designed to promote greater transparency in MFIs' social performance. The award recognizes microfinance providers who provide reports on a set of social performance indicators that were developed over three years through consensus process involving industry leaders and led by SPTF. The awards were launched in order to respond to the growing need to answer questions around social impact and the follow through mission of MFIs.",

                            "The award was presented at the Microfinance India Summit, held in New Delhi on 26, October,2009 and was attended by members of the Ujjivan leadership team: CEO Samit Ghosh, CFO Sudha Suresh, Head of Audit - Lalita Rao, COO (North) ' Vikram Jetley and Head of Administration ' Prem Kumar. G"
                        ]
                    }
                ]
            },
            {
                "text": "Ujjivan Ranked #1 in Microfinance Industry as Best Place to Work June 2009",
                "content": [
                    {
                        "text": [
                            "Ujjivan was awarded the Microfinance Process Excellence Award (MPEA) for excellence in process management among Micro Finance Institutions (MFIs). The awards were sponsored by ABN AMRO and RBS in partnership with PlaNet Finance India.",

                            "The six month long process, culminating in the award ceremony, involved an extensive application and compliance process, training in Process Mapping and Risk Analysis, and then performing this analysis on Ujjivan's own processes. Trainings were attended by Brian Frazier and Sarmila Banerjee. Applications and Analysis were led by Rajat Singh, Veeresh Noolvi, Bhargav Krishna, Mamatha BR, Lance Baptiste, and Dhirendra Singh. The awards were classified into three categories according to the size of competing MFIs ' Flint, Flame and Fire. Flint for young and emerging institutions, Flame for mid sized established institutions preparing for rapid growth phase, and Fire for the large and established institutions setting scorching standards. Award ceremony was held at the Ashok Hotel in Delhi on 11, November, 2008.",

                            "Ujjivan was awarded the Process Excellence Award for the South Region in the Fire Category. Competitors included finalists SKS, Grameen Koota, and Equitas among others."
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan wins Microfinance Process Excellence Award (MPEA) for South Region November 2008",
                "content": [
                    {
                        "text": [
                            "Ujjivan was awarded the Microfinance Process Excellence Award (MPEA) for excellence in process management among Micro Finance Institutions (MFIs). The awards were sponsored by ABN AMRO and RBS in partnership with PlaNet Finance India.",

                            "The six month long process, culminating in the award ceremony, involved an extensive application and compliance process, training in Process Mapping and Risk Analysis, and then performing this analysis on Ujjivan's own processes. Trainings were attended by Brian Frazier and Sarmila Banerjee. Applications and Analysis were led by Rajat Singh, Veeresh Noolvi, Bhargav Krishna, Mamatha BR, Lance Baptiste, and Dhirendra Singh. The awards were classified into three categories according to the size of competing MFIs ' Flint, Flame and Fire. Flint for young and emerging institutions, Flame for mid sized established institutions preparing for rapid growth phase, and Fire for the large and established institutions setting scorching standards. Award ceremony was held at the Ashok Hotel in Delhi on 11, November, 2008.",

                            "Ujjivan was awarded the Process Excellence Award for the South Region in the Fire Category. Competitors included finalists SKS, Grameen Koota, and Equitas among others."
                        ]
                    }
                ]
            },
            {
                "text":"Ujjivan Is Awarded First Ever Unitus Accelerator Award November 2007",
                "content": [
                    {
                        "text": [
                            "At the Unitus Leadership Summit held in Cebu, Philippines, Ujjivan was awarded the Unitus Accelerator Award. The award recognized Ujjivan's role in accelerating the microfinance industry, its innovative approach, and the positive impact it has on the lives of its customers. Ujjivan, a partner of Unitus since 2006, was the first to receive this prestigious award.",

                            "The award was presented to Ajit Grewal, Ujjivan's Executive Director by Geoff Davis, Unitus' CEO, during the Leadership Summit's closing dinner. The award ceremony concluded a dynamic three-day conference that brought together CEOs and COOs from Unitus' global network of MFI partners. The conference was sponsored by The Omidyar Network, and included session led by Pierre Omidyar, founder of eBay and co-founder of the Omidyar Network, and Matt Bannick, former head of eBay International and Managing Partner of Omidyar Network."
                        ]
                    }
                ]
            }
        ]
    }
}