{
    "url": "https://www.ujjivansfb.in/board-of-director",
    "domain": "Home",
    "class": "About Us",
    "main_title": "Board of Directors",
    "subtitle": {
        "elements": [
            {
                "text":"Nitin Chugh",
                "content": [
                    {
                        "text": [
                            "Nitin Chugh is the Managing Director and Chief Executive Officer of our bank. He holds a bachelor’s degree in technology (electrical engineering) from Kurukshetra University and a professional diploma in marketing management from All India Management Association. He has previously worked with HDFC Bank Limited, Standard Chartered Bank, HCL, Hewlett Packard Limited and Modi Xerox Limited. He was appointed as the Managing Director and Chief Executive Officer of our Bank with effect from December 01, 2019."
                        ]
                    }
                ]
            },
            {
                "text":"Jayanta Kumar Basu",
                "content": [
                    {
                        "text": [
                            "Jayanta Kumar Basu is a Non-Executive Director on the Board of our Bank. He holds a bachelor’s degree in arts (economics) from Delhi University and a post graduate diploma in management from the Indian Institute of Management, Ahmedabad. He is currently a partner at CX Advisors LLP. He was previously a senior vice president at Citibank."
                        ]
                    }
                ]
            },
            {
                "text":"Vandana Viswanathan",
                "content": [
                    {
                        "text": [
                            "Vandana Viswanathan is an Independent Director of our Bank. She holds a bachelor’s degree in science from Bangalore University and master’s degree in arts in personnel management and industrial relations from the Tata Institute of Social Sciences. She co-founded and is a partner at Cocoon Consulting."
                        ]
                    }
                ]
            },
            {
                "text":"Chitra Kartik Alai",
                "content": [
                    {
                        "text": [
                            "Chitra Kartik Alai is a Non-Executive Nominee Director of our Bank. She holds a bachelor’s degree in commerce from Osmania University and master’s diploma in business administration from Symbiosis Institute of Management Studies. She is a certified associate of the Indian Institute of Banking and Finance. She is currently a general manager at the Chennai regional office of SIDBI."
                        ]
                    }
                ]
            },
            {
                "text": "Biswamohan Mahapatra",
                "content": [
                    {
                        "text": [
                            "Biswamohan Mahapatra is an Independent Director of our Bank. He holds a master of arts degree from Jawaharlal Nehru University, master of science degree in management from Arthur D. Little Management Education Institute and master of business administration from Delhi University. He was an executive director of the Reserve Bank of India."
                        ]
                    }
                ]
            },
            {
                "text": "Prabal Kumar Sen",
                "content": [
                    {
                        "text": [
                            "Prabal Kumar Sen is an Independent Director of our Bank. He holds a master’s degree in arts (economics) from Calcutta University. He was a professor at XLRI Xavier School of Management, Jharkhand, Institute of Rural Management as a Bank of Baroda chair professor and University of Burdwan. He was previously employed with the United Bank of India and worked as an interpreting officer in the Calcutta High Court."
                        ]
                    }
                ]
            },
            {
                "text": "Nandlal Laxminarayan Sarda",
                "content": [
                    {
                        "text": [
                            "Nandlal Laxminarayan Sarda is an Independent Director of our Bank. He holds a master of technology degree in electrical engineering and doctor of philosophy degree from the Indian Institute of Technology, Bombay. He has previously served as a director on the boards of the Union Bank of India, Clearing Corporation of India and Andhra Bank. He was a professor in the department of computer science and engineering at Indian Institute of Technology, Bombay."
                        ]
                    }
                ]
            },
            {
                "text": "Mona Kachhwaha",
                "content": [
                    {
                        "text": [
                            "Mona Kachhwaha is a Non-Executive Director of our Bank. She hold a post graduate diploma in business management from XLRI Jamshedpur and has completed a private equity programme from Oxford University. She was previously employed with Citibank N.A. and Caspian Impact Investment Adviser Private Limited."
                        ]
                    }
                ]
            },
            {
                "text": "Mahadev Lakshminarayanan",
                "content": [
                    {
                        "text": [
                            "Mahadev Lakshminarayanan is an Independent Director of our Bank. He holds a bachelor’s degree in science from Kerala University and is a chartered accountant from the Institute of Chartered Accountants of India. He was previously a partner at Deloitte Haskins & Sells LLP and Fraser & Ross and is currently director on the board of Aspinwall and Company Limited."
                        ]
                    }
                ]
            }
        ]
    }
}