{
    "url": "https://www.ujjivansfb.in/life-ujjivan",
    "domain": "Home",
    "class": "About Us",
    "main_title": "Life @ Ujjivan",
    "subtitle": {
        "elements": [
            {
                "text": "LIFE @ UJJIVAN",
                "content": [
                    {
                        "text": [
                            
                            "Life at Ujjivan is about people who believe about a purposeful involvement that they can make an extraordinary difference. This mind set forms the cornerstone of our culture. In addition to a challenging and meaningful work, people here have the chance to give back to the community and make a positive impact on the millions of lives. Individuals find the support, coaching, and training it takes to advance their career.",

                            "In our constant endeavor to stay connected with all the employees, we follow an open door policy to foster a culture of innovation within the organization. Various communication channels are made available to people for ideas and suggestions to continually better our policies and processes.",
                            "We strongly believe in the concept of leadership connect. Senior managers have regular deliberations with employees through various forums and on the field. Periodic updates are sent on important organizational issues. Fortnightly review meetings are organized where enabling departments such as administration, human resources and finance meet service delivery functions to understand their requirements and create a better environment for the employees.",

                            "Monthly updates are published and circulated to all employees capturing all the activities across the organization. A quarterly regional newsletter is published which covers all the activities across the region. It also gives voice to the employees' views and opinions and showcases their talent in fields like poetry, painting etc."
                            
                        ]
                    }
                ]
            },
            {
                "text": "Employee Benefits",
                
                "content": [
                    {
                        "text": [
                            
                                "Medical insurance for self and family",
                                "Flexible working hours",
                                "Group term and accident insurance",
                                "Employee Stock Option Plans",
                                "Staff Loans , Housing Loans",
                                "Maternity & Paternity Benefit",
                                "Staff Education grant",

                                "Ujjivan is an equal opportunities employer and recognises everyone equally in areas of employment, including hiring, job assignment, compensation, promotion, discipline and access to benefits and training. We believe in fostering a culture of work-life balance through various initiatives such a fun activities at work, celebrating special occasions, team picnics etc."
                        ]
                    }
                ]
            },
            {
                "text": "Diversity",
                "content": [
                    {
                        "text": [
                            "Being a reputed Small Finance Bank with presence in 24 states and Union Territories across the country, we value the diversity of the geographies in which we operate. Diversity is an integral part of our personnel strategy as well. Ujjivan does not discriminate on the basis of caste, color, religion, sex, national origin, age, medical condition, physical disability, marital status, sexual orientation, gender identity, or any other basis prohibited by law."
                        ]
                    }
                ]
            },
            {
                "text": "Gender inclusivity",
                "content": [
                    {
                        "text": [
                            
                                "We value gender diversity in our workforce, and are committed to promote it through policy as well as practices.",

                                "Ujjivan has a distinct 'Sexual Harassment Policy' in place, which provides the employees an option to complain against any such behaviour. Gender sensitization programs are held continually to primarily propagate our agenda in promoting gender diversity at workplace",

                                "To enforce safety measures especially for our female staff employees, Ujjivan has developed a 'Female Staff Travel Policy', that ensures that appropriate measures of safety are undertaken when the female employee is travelling. Other initiatives include maternity benefits, late night transportation, round the clock security and many more.",

                                "It is our employees who have helped Ujjivan consistently rank among the best organisations to work for.",
                            
                                "2018 : #19 in India's Best Companies To Work For, #18 in Asia's Best Large Workplaces 2018, Ranked amongst the Best in India's Best Companies to Work For in BFSI, 2018",

                                "2017 : #13 in Best Companies To Work For, India, #10 in Asia's Best Large Workplaces 2017",

                                "2016 : #3 in India's Best Companies To Work For, #23 in Best Large Workplaces in Asia 2016",

                                "2015 : #16 in Best Workplaces in Asia; Ranked #1 in Microfinance Industry, India's Best Companies To Work For 2015",

                                "2014 : Most Inspiring Work Places award in BFSI by Banking Frontiers.",

                                "2014 : #9 in overall ,#2 in Financial Services Industry as Best Company to Work For.",

                                "2013 : #7 in overall ,#2 in Financial Services Industry as Best Company to Work For,#2 in Rewards & Recognition Practice,#3in Engaging the Field Force",

                                "2012 : #2 in Financial Services Industry as Best Company to Work For, and, #3 in Leadership Development as Best Company to Work For (across industries)",

                                "2011 : #1 in Microfinance Industry as Best Company to Work For",

                                "2009 : #1 in Microfinance Industry as Best Company to Work For"
                            
                        ]
                    }
                ]
            }
        ]
    }
}