{
    "url": "https://www.ujjivansfb.in/management-team",
    "domain": "Home",
    "class": "About Us",
    "main_title": "Management Team",
    "subtitle": {
        "elements": [
            {
                "text": "Managing Director & CEO",
                "content": [
                    {
                        "text": [
                            "Nitin Chugh is the Managing Director and Chief Executive Officer of our bank. He holds a bachelor's degree in technology (electrical engineering) from Kurukshetra University and a professional diploma in marketing management from All India Management Association. He has previously worked with HDFC Bank Limited, Standard Chartered Bank, HCL, Hewlett Packard Limited and Modi Xerox Limited. He was appointed as the Managing Director and Chief Executive Officer of our Bank with effect from December 01, 2019."
                        ]
                    }
                ]
            },
            {
                "text": "Chief Business Officer",
                "content": [
                    {
                        "text": [
                            "Sanjay Kao is the Chief Business Officer of our Bank. He holds a bachelor of technology degree in chemical engineering from Banaras Hindu University and a post graduate diploma in management from the Indian Institute of Management, Calcutta. He was previously employed with Lipton India Limited, Dunia Finance LLC, Citibank, N.A. and ABN AMRO Bank, N.V. He was appointed as the Chief Business Officer of our Bank with effect from 12, February, 2018."
                        ]
                    }
                ]
            },
            {
                "text": "Head of Human Resources",
                "content": [
                    {
                        "text": [
                            "Carol Furtado is the Head - Human Resources of our Bank. She holds a bachelor of science degree from Bangalore University and post graduate diploma in business administration from Mount Carmel Institute of Management. She has previously worked in ANZ Grindlays Bank, Bank Muscat S.A.O.G and Centurion Bank Limited. In 2009, she was presented with the Financial Women's Association award in recognition of her demonstrated professional commitment from Women's World Banking. She was appointed as the Head - Human Resources of our Bank with effect from 1, February, 2017."
                        ]
                    }
                ]
            },
            {
                "text": "Chief Financial Officer",
                "content": [
                    {
                        "text": [
                            "Upma Goel is the Chief Financial Officer of our Bank. She is a chartered accountant from the Institute of Chartered Accountants of India. She was previously employed with L&T Finance Holdings Limited, Ujjivan Financial Services Limited and Escorts Securities Limited. She joined the Bank as the Chief Financial Officer with effect from 1, February, 2017."
                        ]
                    }
                ]
            },
            {
                "text": "Head of Audit",
                "content": [
                    {
                        "text": [
                            "Alok Chawla is the Head – Audit of the Bank. He holds a bachelor's degree in commerce from the Delhi University. He is a chartered accountant with the Institute of Chartered Accountants of India. He is also a certified internal auditor with the Institute of Internal Auditors, Inc. He was previously employed with Mizuho Bank, Ltd., ING Vysya Bank and Tata Motors Finance Limited. He was appointed as the Head - Audit of our Bank with effect from 2, November, 2018."
                        ]
                    }
                ]
            },
            {
                "text": "Chief Operating Officer",
                "content": [
                    {
                        "text": [
                            "Jaya Janardanan is the Chief Operating Officer of our Bank. She holds a bachelor's degree in commerce and master's degree in commerce from Bombay University. She was previously employed with Alpic Finance Ltd., JP Morgan Chase Bank N.A., ICICI Bank Limited, ING Vysya Bank, Bank of America, Masherq Bank, Dhanlaxmi Bank and Aditya Birla Group. She was appointed as the Chief Operating Officer of our Bank with effect from 22, October, 2018."
                        ]
                    }
                ]
            },
            {
                "text": "Company Secretary and Compliance Officer",
                "content": [
                    {
                        "text": [
                            "Chanchal Kumar is the Company Secretary and Compliance Officer of our Bank. He holds a bachelor's degree in commerce from Delhi University. He is a chartered accountant with the Institute of Chartered Accountants of India and a company secretary withthe Institute of Company Secretaries of India. He is a certified associate of the Indian Institute of Banking and Finance. He was previously employed with Yes Bank, GE Capital Services India, ICICI Bank Limited and Anand Corporate Services Limited. He joined the Bank as the Company Secretary and Compliance Officer with effect from 24, March, 2018."
                        ]
                    }
                ]
            },
            {
                "text": "Head of Channels",
                "content": [
                    {
                        "text": [
                            "Jolly Zachariah is the Head – Channels of our Bank. He holds a bachelor's degree in commerce from Bombay University. He was the chief operating officer (west) of Ujjivan Financial Services Limited and was previously employed with Citigroup. He joined the Bank as the Head – Channels with effect from 1, February, 2017."
                        ]
                    }
                ]
            },
            {
                "text": "Chief Risk Officer",
                "content": [
                    {
                        "text": [
                            "Arunava Banerjee is the Chief Risk Officer of our Bank. He holds a master's degree in arts (economics) from Calcutta University and is an associate of the Indian Institute of Bankers. He was previously employed with State Bank of India, Standard Chartered Bank and Bahraini Saudi Bank. He is the past chief financial officer of Remza Investment Company W.L.L. He was appointed as the Chief Risk Officer of our Bank with effect from 1, February, 2017."
                        ]
                    }
                ]
            },
            {
                "text": "Business Head of MicroBanking and Rural Banking",
                "content": [
                    {
                        "text": [
                            "Rajat Singh is the Business Head – Micro Banking and Rural Banking of our Bank. He has a bachelor's degree in agricultural and food engineering from Indian Institute of Technology, Kharagpur. He joined Ujjivan Financial Services Limited in 2007 as a financial analyst. He was appointed as the Head – Strategy and Planning of our Bank with effect from 1, February, 2017 and was subsequently re-designated as the Head – Micro Banking and Rural Banking on 21, February, 2019."
                        ]
                    }
                ]
            },
            {
                "text": "Head of Digital Banking",
                "content": [
                    {
                        "text": [
                            "Dheemant Thacker is the Head of Digital Banking. He holds a Bachelor of Engineering degree in Mechanical Engineering from University of Mumbai and Masters of Business Administration in Marketing & Finance from Narsee Monjee Institute of Management & Higher Studies. He has previously worked with Aditya Birla Capital, HDFC Bank & Bandhan Bank. He has joined Ujjivan Small Finance Bank with effect of 10, February, 2020 to lead the bank's digital initiatives."
                        ]
                    }
                ]
            },
            {
                "text": "Chief Credit Officer",
                "content": [
                    {
                        "text": [
                            "Kalyanaraman M is the Chief Credit Officer of our bank. He holds a B.E (Hons) Electrical & Electronics Engineering degree from Regional Engineering College, Tiruchi and  Masters of Business Administration (Finance, Systems) from Indian Institute of Management, Calcutta. He was previously employed with SRF Finance Ltd, IIT Investrust Limited, Infrastructure Leasing & Financial Services Ltd, Citibank India, Cholamandalam DBS Finance Ltd, TVS Credit Services & Equitas Small Finance Bank Limited. He was appointed as Chief Credit Officer of our bank with effect from 16, September, 2019."
                        ]
                    }
                ]
            },
            {
                "text": "Head of Treasury",
                "content": [
                    {
                        "text": [
                            "Rajeev Pawar is the Head of Treasury of our bank. He is an MBA from the Jamnalal Bajaj Institute of Management Studies, Mumbai and a Physics Major from the University of Mumbai. He has previously worked with and managed the Treasury business for American Express Bank, Standard Chartered Bank, Kotak Mahindra Bank and Edelweiss Finance in India, Singapore and Dubai. He was appointed as Head of Treasury on 20, January, 2020."
                        ]
                    }
                ]
            }
        ]
    }
}