   {
     "url": "https://www.ujjivansfb.in/v1/mobile-banking",
            "domain": "Business",
            "class": "Mobile Banking",
            "main_title": " MOBILE BANKING",
            "subtitle": {
                "elements": [
                    {
                        "text": "",
                        "content": [
                            {
                                "text": [
                                    " Available in 9 languages: English Hindi Tamil Kannada Bengali Gujarati Oriya Marathi Punjabi",
                                    " English",
                                    " Hindi",
                                    " Tamil",
                                    " Kannada",
                                    " Bengali",
                                    " Gujarati",
                                    " Oriya",
                                    " Marathi",
                                    " Punjabi",
                                    " Anytime banking: Mobile banking gives you the privilege of banking anytime and anywhere.",
                                    " Mobile Banking is free: The service provided by bank is free of charge. Various banking services provided include Account Balance Inquiry, Debit Alerts, Bill Payment Alerts, Transaction History, Fund Transfer Facilities, Minimum Balance Alerts etc. can be accessed from your mobile. You can transfer money instantly to another account in the same bank using mobile banking.",
                                    " Secure Banking: The app comes with advanced technologies making it safe and secure as Internet Banking."
                                ]
                            }
                        ]
                    },
                    {
                        "text": " Registration",
                        "content": [
                            {
                                "text": [
                                    " At the time of opening the account",
                                    " By visiting any of the Bank branch",
                                    " Through ATM",
                                    " Through Phone Banking"
                                ]
                            }
                        ]
                    },
                    {
                        "text": " MPIN generation",
                        "content": [
                            {
                                "text": [
                                    " Once you have registered with the Bank for Mobile Banking, click on New Registration in the pre-login screen of the Mobile Banking Application. Fill the required details; enter the OTP sent to your mobile number registered with the Bank and authenticate through your debit card to generate your MPIN."
                                ]
                            }
                        ]
                    },
                    {
                        "text": " Change MPIN",
                        "content": [
                            {
                                "text": [
                                    " To change your MPIN, login to the Mobile Banking Application with your current MPIN and click on Change MPIN in the Settings tab located in the vertical menu."
                                ]
                            }
                        ]
                    },
                    {
                        "text": " Forgot MPIN",
                        "content": [
                            {
                                "text": [
                                    " If you forget your MPIN, click Forgot MPIN in the pre-login screen of the Mobile Banking Application. Fill the required details; enter the OTP sent to your mobile number registered with the Bank and authenticate through your debit card or answer security questions* to reset your MPIN.",
                                    " *NOTE: You can set security answers in the Settings tab."
                                ]
                            }
                        ]
                    },
                    {
                        "text": "",
                        "content": [
                            {
                                "text": [
                                    " Do's 1) Please keep your mobile banking MPIN confidential. Set an MPIN that is difficult to guess. 2) Set a password for your mobile device to prevent unauthorized access. 3) It is advisable to keep your Mobile Application updated. 4) Always log out from your Mobile Banking application after completing any transaction. Dont's 1) Do not share your MPIN, OTP (One Time Password) or any confidential information with anyone. Ujjivan Small Finance Bank will never ask for such information. 2) Do not store any confidential information such as MPIN, debit card number, CVV number on your mobile device. 3) Do not use unsecured Wi-Fi or shared/public networks while accessing the Mobile Banking application.",
                                    " 1) Please keep your mobile banking MPIN confidential. Set an MPIN that is difficult to guess.",
                                    " 2) Set a password for your mobile device to prevent unauthorized access.",
                                    " 3) It is advisable to keep your Mobile Application updated.",
                                    " 4) Always log out from your Mobile Banking application after completing any transaction.",
                                    " 1) Do not share your MPIN, OTP (One Time Password) or any confidential information with anyone. Ujjivan Small Finance Bank will never ask for such information.",
                                    " 2) Do not store any confidential information such as MPIN, debit card number, CVV number on your mobile device.",
                                    " 3) Do not use unsecured Wi-Fi or shared/public networks while accessing the Mobile Banking application."
                                ]
                            }
                        ]
                    }
                ]
            }
        }