{
    "url": "https://www.ujjivansfb.in/business-micro-loans",
    "domain": "Business",
    "class": "Products",
    "main_title": "MICRO Loans",
    "subtitle": {
        "elements": [
            {
                        "text": "Ujjivan Bank Group Loans",
                        "content": [
                            {
                                "text": [
                                    " Business Loan.",
                                    " Family Loan.",
                                    " Agriculture and Allied Loan.",
                                    " Education Core Loan.",
                                    " GL Top-up Loan.",
                                    " Emergency Loan.",
                                    " Education Loan (Top up).",
                                    " Loyalty Loan.  Loan amount:  `2,000 - `60,000. Rate of Interest: 22% p.a on a reducing balance method (governed by the MCLR based pricing policy of the bank). Processing Fee: 1.2% of loan amount (excluding applicable GST) (applicable for loans above `25,000). Tenure: 6 months/1 year/1.5 years/2 years.",
                                    " Loan amount: `2,000 -  `60,000.",
                                    " Rate of Interest: 22% p.a on a reducing balance method (governed by the MCLR based pricing policy of the bank).",
                                    " Processing Fee: 1.2% of loan amount (excluding applicable GST) (applicable for loans above  `25,000).",
                                    " Tenure: 6 months/1 year/1.5 years/2 years."
                                ]
                            }
                        ]
                    },
                    {
                        "text": "Ujjivan Bank Individual Loans ",
                        "content": [
                            {
                                "text": [
                                    " Individual Business Loan (IBL).",
                                    " Individual Livestock Loan (ILL).",
                                    " Home Improvement Loan (HIL).",
                                    " Individual Agriculture Loan (IAL).",
                                    " Individual Bazaar Loan (IBZL).",
                                    " Open Market Livestock Loan (OMLL).",
                                    " Higher Education Loan (HEL).",
                                    " Open Market Home Improvement Loan (OMHIL).  Loan amount:  `51,000 - `2,00,000 ( `1,00,000 for IAL). Rate of Interest: 23.25% p.a on a reducing balance method (24% for IBZL and OMHIL) (governed by the MCLR based pricing policy of the bank). Processing Fee: 1% - 2% of loan amount (excluding applicable GST) (Zero for HEL). Franking Charge/Stamp duty: As per state act. Late payment charge:  `100 per late EMI (including applicable GST). Pre-closure charge: 2% of the principal outstanding including applicable GST (There is no pre-closure charges if a customer pre-closes her loan after paying 80% of her installments.) (Not applicable for HIL, HEL and OMHIL). Tenure: 6 Months  36 Months (2 years 7 years after commencement of repayment for HEL).",
                                    " Loan amount: `51,000 - `2,00,000 ( `1,00,000 for IAL).",
                                    " Rate of Interest: 23.25% p.a on a reducing balance method (24% for IBZL and OMHIL) (governed by the MCLR based pricing policy of the bank).",
                                    " Processing Fee: 1% - 2% of loan amount (excluding applicable GST) (Zero for HEL).",
                                    " Franking Charge/Stamp duty: As per state act.",
                                    " Late payment charge: `100 per late EMI (including applicable GST).",
                                    " Pre-closure charge: 2% of the principal outstanding including applicable GST (There is no pre-closure charges if a customer pre-closes her loan after paying 80% of her installments.) (Not applicable for HIL, HEL and OMHIL).",
                                    " Tenure: 6 Months 36 Months (2 years  7 years after commencement of repayment for HEL)."
                                ]
                            }
                        ]
                    }
        ]
    }
}