{
    "url": "https://www.ujjivansfb.in/life-events-based-banking-services",
    "domain": "Personal",
    "class": "Products",
    "main_title": "LIFE EVENTS BASED BANKING SERVICES",
    "subtitle": {
        "elements": [
            {
                "text": "LIFE EVENTS BASED BANKING SERVICES",
                "content": [
                    {
                        "text": [
                            "Life has ups and downs. manage them with our banking services.Introducing Life Events Based Banking Services, to help senior citizens manage crucial moments of life."
                        ]
                    }
                ]
            },
            {
                "text": "About Life Events:",
                "content": [
                    {
                        "text": [
                            "Introducing Life Events Based Banking Services at Ujjivan Bank. This program is designed to manage important moments of life and will provide complete banking assistance, so that you can easily sail through both good and bad times."
                        ]
                    }
                ]
            },
            {
                "text": "Special Benefits from Ujjivan Bank for Senior Citizens:",
                "content": [
                    {
                        "text": [
                            "Doorstep banking",
                            "Special assistance when required",
                            "Priority services at branches"
                        ]
                    }
                ]
            },
            {
                "text": "",
                "content": [
                    {
                        "text": [
                            "The following services are specially designed for you so that you can easily sail through crucial events -"
                        ]
                    }
                ]
            },
            {
                "text": "Attaining Senior Citizenship",
                "content": [
                    {
                        "text": [
                            "Attaining senior citizenship is a major milestone in anyone’s life. Enjoy additional benefits that Ujjivan Bank provides. We offer special “No Queue” facility for Senior Citizens so that your transactions are hassle free at our branches."
                        ]
                    }
                ]
            },
            {
                "text": "Conversion of regular Account to Senior Citizen Account",
                "content": [
                    {
                        "text": [
                            "We will convert your account automatically if KYC is updated and you can enjoy all the special benefits."
                        ]
                    }
                ]
            },
            {
                "text": "Doorstep Banking",
                "content": [
                    {
                        "text": [
                            "You can avail Ujjivan Bank services at your convenience and at your doorstep for financial and non-financial transactions."
                        ]
                    }
                ]
            }
        ]
    }
}