{
    "url": "https://www.ujjivansfb.in/life-events-based-banking-services",
    "domain": "Personal",
    "class": "Products",
    "main_title": "LIFE EVENTS BASED BANKING SERVICES",
    "subtitle": {
        "elements": [
            {
                "text": "Provide financial security to your loved ones:",
                "content": [
                    {
                        "text": ""
                    }
                ]
            },
            {
                "text": "Joint Account provide convenience in operating accounts. It also provides financial security to your beloved ones and your legacy will continue as your joint account holder will easily be able to access the funds after you through Survivorship. Joint accounts can help you carry out transactions when you cannot visit branches due to any difficulties.Visit our branch with the person you want to add to your account with basic KYC documents",
                "content": [
                    {
                        "text": "",
                        "table": [
                            {
                                "key": "Open a Joint AccountOpen a Joint Account easily at your door step",
                                "value": [
                                    "Add a Joint Account holderConvert your account to Joint Account to facilitate hassle free transactions"
                                ]
                            },
                            {
                                "key": "Settlement of Claims for accounts with Nominee / SurvivorshipWith the Nominee / Survivorship, claim settlement is made very easy with simple documentation",
                                "value": [
                                    "Settlement of claims for accounts without Nominee / SurvivorshipWe will assist and guide on documentation to ensure hassle free settlement of claims"
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "text": "Nomination",
                "content": [
                    {
                        "text": [
                            "Choose the right person for your account so that you can secure the future of your family members and ensure your hard-earned money goes to the right person without any hassle. Avail nomination facility on your savings and term deposits. Nominate your spouse, grandchild, or your children, NOW!Visit our branch and approach the Front Desk to add or change a nominee to your account. You are free to change the nomination for your accounts any time."
                        ]
                    }
                ]
            }
        ]
    }
}