{
    "url": "https://www.ujjivansfb.in/third-party-product-insurance",
    "domain": "Personal",
    "class": "Products",
    "main_title": "Ujjivan Bank THIRD PARTY PRODUCT (INSURANCE)",
    "subtitle": {
        "elements": [
            {
                "text": "Third Party Product(Insurance)",
                "content": [
                    {
                        "text": [
                            "Ujjivan Small Finance Bank brings you insurance solution from leading providers."
                        ]
                    }
                ]
            },
            {
                "text": "Life insurance partners",
                "content": [
                    {
                        "text": [
                            "Bajaj Allianz Life Insurance Company Limited",
                            "Aditya Birla Sun Life Insurance Company Limited",
                            "HDFC Life Insurance Company Limited"
                        ]
                    }
                ]
            },
            {
                "text": "General Insurance Partners",
                "content": [
                    {
                        "text": [
                            "Bajaj Allianz General Insurance Company Limited",
                            "ICICI Lombard General Insurance Company Limited"
                        ]
                    }
                ]
            },
            {
                "text": "Health Insurance Partners",
                "content": [
                    {
                        "text": [
                            "Apollo Munich Health Insurance Company Limited"
                        ]
                    }
                ]
            },
            {
                "text": "Disclaimer",
                "content": [
                    {
                        "text": [
                            "Insurance is a subject matter of solicitation. Ujjivan Small Finance Bank Limited (\"USFB\") is a corporate agent (IRDA Licence No.CA0169) of Bajaj Allianz Life Insurance Company Limited, Aditya Birla Sun Life Insurance Company Limited, HDFC standard Life Insurance Company Limited, Bajaj Allianz General Insurance Company Limited, ICICI Lombard General Insurance Company Limited, Apollo Munich Health Insurance Company Limited. Insurance is a underwritten by respective Insurance Company. The products, services and benefits referred to herein are subject to terms and conditions governing them as specified by Insurance Company from time to time. For more details on the risk factors, terms and conditions please read sales brochure carefully before concluding a sales. USFB's customer's participation in the policy is entirely voluntary. USFB Shall not be liable or responsible for any loss resulting from insurance company's products/services."
                        ]
                            
                    }
                ]
            }
        ]
    }
}