{
    "url": "https://www.ujjivansfb.in/faq",
    "domain": "Home",
    "class": "Customer Care",
    "main_title": "Frequently Asked Questions (Personal Net Banking)",
    "subtitle": {
        "elements": [
            {
                "text": "What is Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nUjjivan Personal Net Banking is a secure platform that allows anytime anywhere access to banking services on a computer/laptop.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the benefits of Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\n\nA single screen summary of all your accounts with the Bank\nOnline money transfer within few clicks\nAccess to your financial statements and transaction history (e-passbook)\nProvision to apply for various products offered by the Bank\nAccess to multiple service requests such as cheque services, debit card services etc.\nFacility to manage your transaction limit\n\n\n",
                            ""
                        ]
                    }
                ]
            },
            {
                "text": "Who can use Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nAny Ujjivan customer having a savings and/or current account with a valid debit card, a registered mobile number and e-mail with the Bank can use Ujjivan Personal Net Banking.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Which versions of handsets will support Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\n\nInternet explorer 10 or above\nGoogle chrome 23 or above\nMozilla Firefox 13 or above\nApple safari 5 or above\nOpera 12 or above\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "How can I register for Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nYou can register for Ujjivan Personal Net Banking:\n\nWhile opening an account\nAt Bank branch\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "How long will the Bank take to activate my Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nThe Bank will activate your Ujjivan Personal Net Banking within 3 working days, provided you meet all requirements set by the Bank.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is a Customer ID?",
                "content": [
                    {
                        "text": [
                            "\nA Customer ID is a unique identity given to you by the Bank for using Ujjivan Personal Net Banking.\n"
                        ]
                    }
                ]
            },
            {
                "text": "If I have more than one account with the Bank, will I have different Customer IDs for each account?",
                "content": [
                    {
                        "text": [
                            "\nNo, you will have a single Customer ID for all your accounts with the Bank.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is OTP?",
                "content": [
                    {
                        "text": [
                            "\nOTP refers to One Time Password that will be sent to your mobile number registered with the Bank.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How can I set a new password for Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nOnce you have registered for Ujjivan Personal Net Banking, click on “New Registration” in the pre-login screen. Fill the required details (Customer ID, Date of birth and registered mobile number); enter the OTP sent to your mobile number registered with the Bank and set security questions to generate your password.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Will I have to answer security questions every time I use Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nNo, you will not have to answer questions every time you use Ujjivan Personal Net Banking.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How can I change my password?",
                "content": [
                    {
                        "text": [
                            "\nTo change your password, login to Ujjivan Personal Net Banking and click on “Change password” from “Settings” option located in the vertical menu.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What should I do if I forget my Customer ID?",
                "content": [
                    {
                        "text": [
                            "\nSMS “CUST” to 9243232121 from your mobile number registered with the Bank\n"
                        ]
                    }
                ]
            },
            {
                "text": "What if I forget my password?",
                "content": [
                    {
                        "text": [
                            "\nIf you forget your Password, click on “Forgot Password” in the pre-login screen of Ujjivan Personal Net Banking. Fill in the required details (Customer ID, Date of birth and registered mobile number); enter the OTP sent to your registered mobile number with the Bank and answer the security questions set by you at the time of registration, to reset your password.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How can I discontinue Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nTo discontinue Ujjivan Personal Net Banking, please contact the Bank branch and fill a de-registration form.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Where can I read the terms and conditions of Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\n\nPlease click the following link for terms and conditions related to Ujjivan\nPersonal Net Banking\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is My Accounts?",
                "content": [
                    {
                        "text": [
                            "\n“My Accounts” displays details of your Savings and/or Current account with the Bank.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How can I check my transaction details using Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nClick on Savings or Current account and select the account number for transaction details\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is E-passbook?",
                "content": [
                    {
                        "text": [
                            "\n“E-passbook” in Ujjivan Personal Net Banking shows your transaction history of the selected account.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can I open a Fixed Deposit or Recurring Deposit using Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nYes, you can open a Fixed Deposit or Recurring Deposit account using Ujjivan Personal Net Banking.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can I open more than one Fixed Deposit or Recurring Deposit accounts using Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nYes, you can open more than one Fixed Deposit or Recurring Deposit accounts using Ujjivan Personal Net Banking.\n"
                        ]
                    }
                ]
            },
            {
                "text": "If I open a Fixed Deposit or Recurring Deposit at the Bank branch, will that be visible in Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nYes, all your accounts opened at the Bank branch will be visible in Ujjivan Personal Net Banking.\n"
                        ]
                    }
                ]
            },
            {
                "text": "If I open a Fixed Deposit or Recurring Deposit using Ujjivan Personal Net Banking, will that be visible in Ujjivan Mobile Banking?",
                "content": [
                    {
                        "text": [
                            "\nYes, all your accounts opened using Ujjivan Personal Net Banking will be visible in Ujjivan Mobile Banking.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the different money transfer options available in Ujjivan Mobile Banking?",
                "content": [
                    {
                        "text": [
                            "\n\nMoney transfer to My Accounts (linked accounts)\nMoney Transfer to Other Ujjivan Accounts\nIMPS (Immediate Payment Service)\nNEFT (National Electronic Fund Transfer)\nRTGS (Real Time Gross Settlement)\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "Who is a payee or beneficiary?",
                "content": [
                    {
                        "text": [
                            "\nA payee or beneficiary is a person to whom you want to transfer money.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What can I do if my transaction fails or the beneficiary does not receive money?",
                "content": [
                    {
                        "text": [
                            "\nIf you transaction fails or the beneficiary does not receive money, please note the transaction ID and contact Ujjivan Phone banking.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can I transfer money without adding a new payee or beneficiary?",
                "content": [
                    {
                        "text": [
                            "\nNo, adding a new payee or beneficiary is mandatory for transferring money using Ujjivan Mobile Banking.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How do I add a new payee or beneficiary in Ujjivan Mobile Banking?",
                "content": [
                    {
                        "text": [
                            "\nYou can add new payee or beneficiary using the following steps:\n\nAfter logging in, click on “Money Transfer” option in the vertical menu\nClick on “Manage beneficiary “and choose “Add beneficiary”\nSelect the type of Money Transfer to fill details\nEnter the OTP sent to the mobile number registered with the Bank\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "If I add a new payee or beneficiary in Ujjivan Personal Net Banking, will that be available in Ujjivan Mobile Banking as well?",
                "content": [
                    {
                        "text": [
                            "\nYes, any new payee or beneficiary added in Ujjivan Personal Net Banking will also be available in Ujjivan Mobile Banking as well.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is a favourite transaction?",
                "content": [
                    {
                        "text": [
                            "\nA favourite transaction is a feature you can use to add your most frequent transactions and use it for quick and easy access.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How many favourite transactions can I add?",
                "content": [
                    {
                        "text": [
                            "\nYou can add up to 10 favourite transactions and use it for quick and easy access.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How can I delete/remove a favourite transaction?",
                "content": [
                    {
                        "text": [
                            "\nTo delete a favourite transaction, select “Manage Favorites” from the Settings option menu located in the vertical menu.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the other services offered in Ujjivan Mobile Banking?",
                "content": [
                    {
                        "text": [
                            "\nServices offered by Ujjivan Mobile Banking are as follows:\nCheque services\n\nRequest cheque book\nStop payment of cheque\nCheque status enquiry\n\nNew Account Request\n\nSavings Account\nCurrent Account\nFixed Deposit\nRecurring Deposit\nLoan\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is a debit card hotlist?",
                "content": [
                    {
                        "text": [
                            "\nA debit card hotlist is a list of debit cards that are permanently disabled by the Bank upon your request. Such cards are reported stolen, canceled and/or compromised in some way.\n"
                        ]
                    }
                ]
            },
            {
                "text": "I have lost my debit card. Can I block my debit card using Ujjivan Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nYes, you can hotlist/block your debit card using Ujjivan Personal Net Banking by selecting “Debit card hotlisting” from “Cards” option located in the vertical menu.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How can I request a new debit card from the Bank?",
                "content": [
                    {
                        "text": [
                            "\nTo request a new debit card, click on “Debit Card Request” from the “Cards” option located in the vertical menu\n"
                        ]
                    }
                ]
            },
            {
                "text": "How can I control my Money Transfer limit in Ujjivan Personal Net Banking ?",
                "content": [
                    {
                        "text": [
                            "\nTo control your Money Transfer limit, Click on ‘Manage Limit’ in the ‘Settings’ option located in the vertical Menu.\n"
                        ]
                    }
                ]
            }
        ]
    }
}