{
    "url": "https://www.ujjivansfb.in/faq",
    "domain": "Home",
    "class": "Customer Care",
    "main_title": "Frequently Asked Questions (Home Loan)",
    "subtitle": {
        "elements": [
            {
                "text": "How will Ujjivan decide my home loan eligibility?",
                "content": [
                    {
                        "text": [
                            "\nUjjivan assess the customer's repayment capacity based on household income and loan requirement.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the maximum loan I can get?",
                "content": [
                    {
                        "text": [
                            "\n\n`75,00,000.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the fees and charges applicable?",
                "content": [
                    {
                        "text": [
                            "\nRanging from 1.5% - 2% of loan amount (exclusive of taxes).\n"
                        ]
                    }
                ]
            },
            {
                "text": "Are there any additional charges for Bounce and Late payment?",
                "content": [
                    {
                        "text": [
                            "\n\nYes,\n`200\nfor a delay of 7 days and\n`400\nfor a delay of more than 7 days, taxes applicable. All terms and conditions are at the sole discretion of Ujjivan Small Finance Bank. The bank reserves the right to change/modify any of the above at any time.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What Property can be considered as collateral for Home?",
                "content": [
                    {
                        "text": [
                            "\nYou can provide your self-occupied residential property as collateral where construction is proposed or the property you are going to buy in case of Home Purchase Loan.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How do I apply for a Home Loan at Ujjivan?",
                "content": [
                    {
                        "text": [
                            "\nYou can contact our home loan team at your nearest Ujjivan branch or give a miss call on 9241434343\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is PDC?",
                "content": [
                    {
                        "text": [
                            "\nPDC stands for Post dated cheques. PDCs are collected for repayment of EMIs.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the documents required to avail Home Loan from Ujjivan?",
                "content": [
                    {
                        "text": [
                            "\nFor Salaried Individuals\n\nProof of Residence - Any one of Ration Card/Telephone Bill/Electricity Bill/Voters Card/Aadhar Card.\nProof of Identity - Any one of Voters Card/Drivers License/Aadhar Card/Passport.\nLatest 6 months Bank Statement/Passbook.\nOriginal Property Documents.\nSalary certificate wherever applicable.\n\nFor Self-Employed Individuals\n\nProof of business – Business registration proof, E-bill, Rent agreement etc.\nProof of Residence - Any one of Ration Card/Telephone Bill/Electricity Bill/Voters Card/Aadhar Card.\nProof of Identity - Any one of Voters Card/Drivers License/Aadhar Card/Passport.\nLatest 6 months Bank Statement/Passbook.\nOriginal Property Documents.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "How much time will it take to decide upon an application for Home Loan at Ujjivan?",
                "content": [
                    {
                        "text": [
                            "\nApplications would be decisioned within 7 working days.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is interest rate for pre-EMI and EMI?",
                "content": [
                    {
                        "text": [
                            "\nEMI interest rate is 12.75-17.75% depending on customer profile and requirement.\nPending final disbursement, you pay interest on the portion of the loan disbursed. This interest is called pre-EMI interest. Pre-EMI interest is payable every month from the date of each disbursement up to the date of commencement of EMI. The interest rate is same as that of EMI.\n*Conditions apply. All Home Loans from Ujjivan Small Finance Bank Credit are at sole discretion of Ujjivan Small Finance Bank.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can I give standing instructions to repay my Home Loan EMIs directly from my Ujjivan Saving Bank Account?",
                "content": [
                    {
                        "text": [
                            "\nYes, you can opt for Automated Repayment and your EMIs will be directly repaid from your Ujjivan Small Finance Bank Savings Account, thus saving you the trouble of procuring, signing and tracking post-dated cheques.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Are my property documents safe with Ujjivan Small Finance Bank?",
                "content": [
                    {
                        "text": [
                            "\nUjjivan offers in-house scrutiny of property documents for your complete peace of mind. So be assured that your property documents are in safe hands.\nFor more details, please contact your nearest Ujjivan branch or give a miss call on 9241434343\n"
                        ]
                    }
                ]
            }
        ]
    }
}