{
    "url": "https://www.ujjivansfb.in/faq",
    "domain": "Home",
    "class": "Customer Care",
    "main_title": "Frequently Asked Questions (Recurring Deposit)",
    "subtitle": {
        "elements": [
            {
                "text": "What is a recurring deposit (RD)?",
                "content": [
                    {
                        "text": [
                            "\nRecurring deposits (RD) is an account where a customer invests a fixed sum of money every month in his recurring deposit account maintained with the bank. The interest is earned as per the pre-determined rate usually the same as fixed deposit rate. These accounts can be funded by giving standing instructions by which bank withdraws a fixed amount on a fixed date of the month from the Bank savings account of the customer (as per his instructions), and the same is credited to RD account.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the features of an Ujjivan Small Finance Bank Recurring Deposit?",
                "content": [
                    {
                        "text": [
                            "\n\nPlease refer to Recurring Deposit offerings on our website.\nClick Here\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the minimum deposit amount required for opening a Recurring Deposit account?",
                "content": [
                    {
                        "text": [
                            "\n\nThe minimum Instalment to be deposited by the Depositor/s shall be\n`100\nas specified in the AOF, which can be increased in multiples of\n`100.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the range of tenure for which I can open a recurring deposit account?",
                "content": [
                    {
                        "text": [
                            "\nYou can open a recurring deposit for a minimum period of 6 months, and thereafter in multiples of 3 months, maximum up to a period of 10 years.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the Interest rates offered by you on recurring deposits?",
                "content": [
                    {
                        "text": [
                            "\n\n\nClick here\n\nfor details.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the penal rate of interest in case of premature withdrawal?",
                "content": [
                    {
                        "text": [
                            "\nPlease refer to our penal rate of interest charges. Click here.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Is there an interest pay-out option?",
                "content": [
                    {
                        "text": [
                            "\nInterest is paid when the recurring deposit account is closed, and on maturity.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can I change the tenure and installment due date of my recurring deposit?",
                "content": [
                    {
                        "text": [
                            "\nNo, it is not possible to change the tenure and installment due date.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Is TDS applicable on recurring deposits?",
                "content": [
                    {
                        "text": [
                            "\n\nFor Recurring Deposits, TDS is not applicable on the interest earned up to\n`10,000\nunder Section 194A. However, TDS will be applicable if the interest received or likely to be received, during the financial year, exceeds\n`10,000.\n\nTax Deduction at Source (TDS) will be applicable on interest paid/ accrued on Recurring Deposits. In case the deposit holder does not want the Tax to be deducted at source, they may submit Form 15G / 15H (other than company, firm or co-operative society)/ Exemption Certificate under Section 197 (in case of all holders)/ or any other Tax Exemption Certificate with the Bank. Such form or tax exemption certificate has to be submitted every financial year for each recurring deposit held with the Bank. For further details contact the bank branch.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How do I open a Recurring Deposit?",
                "content": [
                    {
                        "text": [
                            "\n\nExisting Customers of the Bank savings account may open a recurring deposit by visiting the nearest Bank branch, logging into www.ujjivansfb.in, through Mobile and Net Banking or at Center Meetings (up to\n`5,000).\nNew Customers may also place a request by visiting the nearest Bank branch.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can partial payments be made on recurring deposits?",
                "content": [
                    {
                        "text": [
                            "\nPartial payments are not possible.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Do Senior Citizens get any extra benefit on recurring deposits?",
                "content": [
                    {
                        "text": [
                            "\nYes, Senior Citizens gain an additional 0.50% rate of interest.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can I redeem my recurring deposit before the original term?",
                "content": [
                    {
                        "text": [
                            "\nYes, Recurring deposit can be redeemed before the original term. Please contact the bank branch for further details.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What if certain recurring deposit installments are not paid?",
                "content": [
                    {
                        "text": [
                            "\nIf six consecutive installments are unpaid, the Bank reserves the right to close the recurring deposit account. The interest rate applicable on such closed accounts will be as per the premature withdrawal policy of the Bank. A penalty would be charged for delayed payment. For further details please contact the Bank branch.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Is nomination facility available for recurring deposits?",
                "content": [
                    {
                        "text": [
                            "\nYes, there is a nomination facility on the recurring deposit account.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can I change the nominee(s) for my recurring deposit?",
                "content": [
                    {
                        "text": [
                            "\nYes, you change the nominee(s) of the deposit accounts by making a declaration effect in the appropriate form, which is available with the Bank branch.\n"
                        ]
                    }
                ]
            }
        ]
    }
}