{
    "url": "https://www.ujjivansfb.in/faq",
    "domain": "Home",
    "class": "Customer Care",
    "main_title": "Frequently Asked Questions (Savings Account)",
    "subtitle": {
        "elements": [
            {
                "text": "How do I approach Ujjivan Small Finance Bank to open a Savings Account?",
                "content": [
                    {
                        "text": [
                            "\nYou may open a Savings Account with Ujjivan Small Finance Bank through any of the following channels:\n\nCall on our toll free number 1800 208 2121\n\nPlace a request through our website/\n\nWalk into any of our branches\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the rate of interest I will earn on the balance in my Savings Account?",
                "content": [
                    {
                        "text": [
                            "\nInterest on a Savings Account is paid at 4.00% p.a. on a daily end of day balance, w.e.f. 1, February, 2017.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the frequency of interest payout for a Savings Account?",
                "content": [
                    {
                        "text": [
                            "\nInterest earned on your Savings Account balance shall be credited to your account on Quarterly basis.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What happens if I don't use my savings account for a very long time?",
                "content": [
                    {
                        "text": [
                            "\nThe account becomes dormant if there are no customer initiated transactions (excludes system generated transactions like credit interest, debit interest), in the account for a continuous period of two years.\n\nIf the account status is 'Dormant', transactions through Direct Banking Channels like\n\nATM,\n\n\nNet Banking,\n\n\nPhoneBanking\n\nare not be allowed by the Bank.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the procedure to add/modify or delete a nominee for all my accounts?",
                "content": [
                    {
                        "text": [
                            "\nObtain an application form from any Ujjivan Small Finance Bank branch, fill in the application form duly signed by all the holders and submit it to your nearest branch.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How do I register for Email Statement/s?",
                "content": [
                    {
                        "text": [
                            "\nYou may choose either of the following options to register for an Email Statement of your Account:\n\nContact our phone banking Toll Free Number 1800 208 2121.\n\nContact your nearest Ujjivan branch\nand submit an application.\n\n\n\n",
                            ""
                        ]
                    }
                ]
            },
            {
                "text": "How can I change / add the email ID in my account?",
                "content": [
                    {
                        "text": [
                            "\nPlease submit the application form available at the Branch (duly signed by all the holders).\n"
                        ]
                    }
                ]
            },
            {
                "text": "How do I update my PAN number?",
                "content": [
                    {
                        "text": [
                            "\nPlease follow the procedure mentioned below to update you PAN number:\nStep 1) Submit a written request specifying your updated PAN number\nStep 2) Give a self-attested photocopy of your PAN card. (Carry originals for verification)\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the time taken to realize outstation cheques?",
                "content": [
                    {
                        "text": [
                            "\n\nCheques drawn on metros and state capitals (other than Sikkim and North Eastern states) where USFB has a branch: 7 business days\nCheques drawn on major cities where USFB has a branch: 10 business days\nCheques drawn on locations where USFB has a correspondent bank arrangement: 14 business days\nCheques drawn on locations where USFB has neither a branch nor a correspondent bank arrangement: 14 business days\n\n\nFor more details on the outstation cheque collection policy, Contact Us.\n",
                            ""
                        ]
                    }
                ]
            },
            {
                "text": "How can I request for Physical Statement/s?",
                "content": [
                    {
                        "text": [
                            "\n\nE-Statement of Accountscan be downloaded through\n\nNet Banking\n\nand printed by you. You may also avail a statement of account from your\n\nnearest Ujjivan branch\n\nas and when required which is chargeable at\n`\n50\nper statement. Further, you may contact the branch to leave standing instructions to receive physical monthly statement of accounts which shall also be chargeable at\n`\n50\nper annum.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "Reissuance of ATM/Debit Card PIN?",
                "content": [
                    {
                        "text": [
                            "\nYou may submit a request at the nearest Ujjivan branch or contact our phone banking toll free number 1800 208 2121.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How can I change / update the address for my account?",
                "content": [
                    {
                        "text": [
                            "\n\nYou may submit a written request at the\n\nnearest Ujjivan branch\n\nalong with requisite documents.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "How do I activate a 'Dormant' Savings Account?",
                "content": [
                    {
                        "text": [
                            "\nPlease follow the steps mentioned below to activate your account:\nStep 1) Approach the branch in person.\nStep 2) Submit a written request for activation of your dormant account, signed as per operating instructions in the account.\nStep 3) Furnish proof of identity and Address (carry the original for verification)\nStep 4) Initiate a transaction and your account will be activated once again.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How Do I Change / Add my Mobile Number?",
                "content": [
                    {
                        "text": [
                            "\nYou may contact your nearest Ujjivan branch  to update your registered mobile number.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Do I have any facility for Standing Instruction?",
                "content": [
                    {
                        "text": [
                            "\n\nYes, you can set up standing instructions through your\n\nUjjivan Small Finance Bank Savings Account. A few examples of the same are as below:\n\n\n\nTransfer to a Recurring Deposit\nMake recurring payments like RD Installments, Loan EMIs, etc.\n\nFor more details please contact your nearest Ujjivan Small Finance Bank branch.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the different channels through which I can access my Ujjivan Small Finance Bank Savings Account?",
                "content": [
                    {
                        "text": [
                            "\nYou can access your Savings Account through:\n\nUjjivan Small Finance Bank branches\nUjjivan Small Finance Bank Website – www.ujjivansfb.in\nUjjivan Small Finance Bank ATMs\nUjjivan Small Finance Bank’s Phone Banking Toll Free Number – 1800 208 2121\nUjjivan Small Finance Bank’s Mobile Banking app\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can an Individual have any number of 'Basic Savings Bank Deposit Account' in one bank?",
                "content": [
                    {
                        "text": [
                            "\nNo. An individual is eligible to have only one 'Basic Savings Bank Deposit Account'  in one bank.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Whether a 'Basic Savings Bank Deposit Account' holder can have any other saving account in that bank?",
                "content": [
                    {
                        "text": [
                            "\n\nHolders of 'Basic Savings Bank Deposit Account' at Ujjivan Small Finance Bank will not be eligible for opening any other savings account in Ujjivan Small Finance Bank. If a customer has any other existing savings account in the bank, he / she will be required to close it within 30 days from the date of opening a\n\n'Basic Savings Bank Deposit Account'.\n\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "Whether the ‘Basic Savings Bank Deposit Account’ can be opened by only certain types of individuals like poor and weaker sections of the population?",
                "content": [
                    {
                        "text": [
                            "\nNo. The 'Basic Savings Bank Deposit Account' should be considered as a normal banking service available to all customers, through branches.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Whether there are any restrictions like age, income, amount etc. criteria for opening BSBDA by banks for individuals?",
                "content": [
                    {
                        "text": [
                            "\nNo. Banks are advised not to impose restrictions like age and income criteria of the individual for opening BSBDA.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Whether the normal saving bank account can be converted into BSBDA at the request of customer?",
                "content": [
                    {
                        "text": [
                            "\n\nYes. You may do so by submitting a written request at the\n\nnearest Ujjivan Small Finance Bank branch.\n\nThe features and services available in BSBDAs shall be applicable to the account from the following month.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the conditions stipulated for accounts which are additionally to be treated as ‘BSBDA-Small Account’?",
                "content": [
                    {
                        "text": [
                            "\nAs notified in terms of Govt of India notification dated 16, December, 2010, BSBDA-Small Accounts would be subject to the following conditions:\ni.  Total credits in such accounts should not exceed one lakh rupees in a year.\nii. Maximum balance in the account should not exceed fifty thousand rupees at any time\niii.    The total of debits by way of cash withdrawals and transfers will not exceed ten thousand rupees in a month\niv. Foreign remittances cannot be credited to Small Accounts without completing normal KYC formalities\nv.  Small accounts are valid for a period of 12 months initially which may be extended by another 12 months if the person provides proof of having applied for an Officially Valid Document.\nvi. Small Accounts can only be opened at CBS linked branches of banks or at such branches where it is possible to manually monitor the fulfilments of the conditions.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What features and benefits are offered with the BSBDA Small Accounts?",
                "content": [
                    {
                        "text": [
                            "\nYou can access your Savings Account through:\n\nYou need not deposit an initial amount and you don’t have to maintain an Average Monthly Balance.\nFree passbook facility for all account holders (individuals)\nEnjoy free cash and cheque deposits at all Ujjivan Small Finance Bank branches and ATMs\nEnjoy NEFT and IMPS services\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the eligibility criteria to open a BSBDA Small Account?",
                "content": [
                    {
                        "text": [
                            "\n\nYou are eligible to apply for a\n\nBSBDA Small Account\n\n\n\nYou do not have any other banking relationship with Ujjivan Small Finance Bank\nare a resident individual and do not have complete KYC.\n\nTo be more specific, a residential individual who does not have:\n\nPhoto ID proof as per the bank’s acceptable list of documents.\nAddress proof as per the bank’s acceptable list of documents.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the eligibility criteria to open a Minor Savings account?",
                "content": [
                    {
                        "text": [
                            "\n\nA\n\nMinor Savings Account\n\ncan be opened for your child as long as your child is a minor (up to 18 years of age) and necessary KYC documents  are provided.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the KYC requirements to open a Minor Account?",
                "content": [
                    {
                        "text": [
                            "\nFollowing are the KYC documents required to open a Minor account:\n\nProof of date of birth of minor\nLatest photograph (Passport size) – One\nIdentity and address proof of the parent/ guardian (RBI mandated KYC)\nRelationship proof\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "Does the minor account have to be closed when my child turns major?",
                "content": [
                    {
                        "text": [
                            "\n\nNo.The existing minor account can be converted to a regular savings account upon submission of requisite proof of your child having attained majority at the\n\nnearest Ujjivan Small Finance Bank branch\n\n\n"
                        ]
                    }
                ]
            }
        ]
    }
}