{
    "url": "https://www.ujjivansfb.in/faq",
    "domain": "Home",
    "class": "Customer Care",
    "main_title": "Frequently Asked Questions (MSE)",
    "subtitle": {
        "elements": [
            {
                "text": "What are the types of loans I can apply for?",
                "content": [
                    {
                        "text": [
                            "\nBased on the financial needs of your business, you can apply for the following loans:\n\n\nUnsecured Business Loan (\n`1,50,000\nto\n`3,00,000)\n\n\nUnsecured Business Loan (\n`3,00,000\nto\n`5,00,000)\n\n\nSecured Enterprise Loan (\n`10,00,000\nto\n`25,00,000)\n\n\n\nHowever, the final amount of disbursal will be decided by Ujjivan based on the assessment done by its field staff.\n",
                            ""
                        ]
                    }
                ]
            },
            {
                "text": "What is the business loan amount that I can avail?",
                "content": [
                    {
                        "text": [
                            "\n\nYou can avail a business loan between\n`1,50,000\nto\n`25,00,000.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "Up to what amount can be disbursed?",
                "content": [
                    {
                        "text": [
                            "\n\nou can avail a business loan between\n`1,50,000\nto\n`25,00,000,\nin intervals of\n`10,000,\nbased on your eligibility.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the maximum tenure of business loans?",
                "content": [
                    {
                        "text": [
                            "\nDepending on the loan you have applied for, you can have tenure anywhere between 1 year to 7 years.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How will the loan be disbursed to me?",
                "content": [
                    {
                        "text": [
                            "\nThere are two modes for this: Either NEFT/RTGS or cheque as per your convenience and preference..\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can I pre- close my loan?",
                "content": [
                    {
                        "text": [
                            "\nYou can pre-close your loan. However, there will be a:\n\n5% penalty on the outstanding principle, if the loan is pre-closed within 12 months of loan disbursement.\n3% penalty on the outstanding principle, if the loan is pre-closed after 12 months of loan disbursement.\n\n\n",
                            ""
                        ]
                    }
                ]
            },
            {
                "text": "For what requirement can I avail business loan?",
                "content": [
                    {
                        "text": [
                            "\nWorking Capital: Purchase of Stock (Raw Material and Finished goods), Payment to creditors, Financing of Debtors and for keeping cash to meet day to day operating expenses.\nCapital Expenditure: Purchase of New or old equipment, investing in purchase or renovation of office/ factory/godown or other business premises.\nDebt Consolidation.\n"
                        ]
                    }
                ]
            }
        ]
    }
}