{
    "url": "https://www.ujjivansfb.in/faq",
    "domain": "Home",
    "class": "Customer Care",
    "main_title": "Frequently Asked Questions (Personal Loans)",
    "subtitle": {
        "elements": [
            {
                "text": "What can be a use for a personal loan (PL)?",
                "content": [
                    {
                        "text": [
                            "\nPersonal Loans from Ujjivan Bank can be used for several expenses such as Marriage, Vacation, Home renovation, Educations, Pay off of other debts, Purchase of the vehicle, etc.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the eligibility criteria to avail personal loans from Ujjivan Bank?",
                "content": [
                    {
                        "text": [
                            "\nare the eligibility criteria to avail personal loan from Ujjivan bank-\n\nAge limit should be between 22-58 years (58 at the end of loan tenure)\nA salaried individual is having min work experience of 2 years\nResiding in the same house for at least one year\n\nMinimum take home salary of\n`15,000\n\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "Do I need to pledge something as security for getting a PL?",
                "content": [
                    {
                        "text": [
                            "\nNo. A personal loan is an unsecured loan. You don’t need to pledge anything as security.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Is there a minimum personal loan amount that I need to borrow?",
                "content": [
                    {
                        "text": [
                            "\nYes, Personal Loan from Ujjivan Bank offers a minimum of ₹ 50,000 and maximum of ₹ 15 Lac.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the tenure of a personal loan?",
                "content": [
                    {
                        "text": [
                            "\nTenure of personal loan can vary between 1-5 years, on the rests of 6 months.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can I apply for a personal loan jointly with my spouse?",
                "content": [
                    {
                        "text": [
                            "\nNo, presently personal loan at Ujjivan is available to ‘Individuals only’, so you can not club income of your spouse with your income for loan eligibility.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How is the personal loan disbursed?",
                "content": [
                    {
                        "text": [
                            "\nOnce a personal loan is approved it is disbursed directly to your salary account.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How to repay the personal loan?",
                "content": [
                    {
                        "text": [
                            "\nThe EMIs for Personal Loan will be deducted from your salary account through ACH/SI mandate. If the ACH is not honored due to insufficient funds, then you can pay in cash by visiting our branch or can also pay online by visiting payment links provided on our website.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Do you offer to top up on existing Personal Loans?",
                "content": [
                    {
                        "text": [
                            "\nNo, Ujjivan doesn’t offer any top up on existing Personal Loan.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How do I approach Ujjivan Bank for a Personal Loans?",
                "content": [
                    {
                        "text": [
                            "\n\nYou can apply for a personal loan in Ujjivan by calling our toll free number 1800 208 2121, visiting our branch, ATM or visit our website https://www.ujjivansfb.in/\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "In which location we can avail Ujjivan Personal Loan?",
                "content": [
                    {
                        "text": [
                            "\nCurrently, we are offering Personal Loan in the following locations-\n\n\n\n\n\n\nAhmedabad\nDelhi\nKolkata\nPune\n\n\nAnkleshwar\nFaridabad\nMumbai\nSurat\n\n\nBangalore\nGhaziabad\nMysore\nVadodara\n\n\nBharuch\nGurugram\nNoida\nChennai\n\n\nCoimbatore\nCochin\nMysore\n\n\n\n",
                            "\n\n\n\n\n\nAhmedabad\nDelhi\nKolkata\nPune\n\n\nAnkleshwar\nFaridabad\nMumbai\nSurat\n\n\nBangalore\nGhaziabad\nMysore\nVadodara\n\n\nBharuch\nGurugram\nNoida\nChennai\n\n\nCoimbatore\nCochin\nMysore\n\n\n",
                            "\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the documents required to apply for personal loans from Ujjivan?",
                "content": [
                    {
                        "text": [
                            "\nFollowing are the documents required to apply for the Personal Loan from Ujjivan\n\nPAN Card and Aadhaar card\nValid current address proof if the address in Aadhaar address differs\nThree months’ payslip\nSix months bank statement\nCompany ID card\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What happens if I miss an EMI payment or there is an ECS bounce?",
                "content": [
                    {
                        "text": [
                            "\n\nIn the course of EMI default, the bank will levy EMI bounce charge of\n`\n250 plus taxes and penal interest of 2.5% per month on the overdue amount for the number of days of delay.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the prevailing rates for personal loans?",
                "content": [
                    {
                        "text": [
                            "\n\nThe rates for the personal loan at Ujjivan vary between 16.49%-23.99% with EMI starting from as low as\n`2458\nper lac. Having said that the personal loan given to an individual depends upon his profile and loan amount needed. To know more, please click on check your eligibility button in our website.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "Is there any extra charge payable when applying for a personal loan?",
                "content": [
                    {
                        "text": [
                            "\nThere are no additional charges to be paid up front. Following are the only charges applicable -\n\nProcessing Fee\nInsurance Premium\nStamp Duty (In case E-sign fails)\n\nAll the above charges will be netted off from your loan amount at the time of disbursement\n"
                        ]
                    }
                ]
            },
            {
                "text": "Are personal loan interest rates fixed or floating?",
                "content": [
                    {
                        "text": [
                            "\nInterest rates for Personal Loan will be fixed(reducing balance).\n"
                        ]
                    }
                ]
            },
            {
                "text": "Do you offer an Insurance Facility for the Loans, what would be the premium amount?",
                "content": [
                    {
                        "text": [
                            "\nYes, the Insurance facility provided with the loan is credit shield which will cover the loan outstanding in case of unfortunate death of the customer. The premium will depend upon the age of the customer, loan amount and tenure and will be informed to the customer at the time of application process.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are pre-payment/foreclosure charges?",
                "content": [
                    {
                        "text": [
                            "\n\n\nBefore completion of 6 EMIs- pre-closure not allowed.\n\n\nAt least 6 EMIs and before 12 EMIs- charges would be 3% of the principal outstanding, plus taxes as applicable.\n\n\nAt least 12 EMIs and before 24 EMIs- charges would be 2% of the principal outstanding, plus taxes as applicable.\n\n\nAfter completion of 24 EMIs- 1% of the principal outstanding, plus taxes as applicable.\n\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "How can I check my eligibility of the Personal Loan?",
                "content": [
                    {
                        "text": [
                            "\nYou can check your eligibility and view EMI amount, processing fees, repayment schedule, etc. by visiting our website or calling our Phone banking team on 1800 208 2121.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the different options to apply for the Ujjivan Personal Loan?",
                "content": [
                    {
                        "text": [
                            "\nAfter checking your eligibility, you will have two options to fill out the application form and submit the documents. Either you can apply online via Self Mode or by directly interacting with our Loan Officer via Assisted Mode. You will also be eligible for a rebate/discount on your Processing Fees if you opt for Self Mode for Personal Loan Application.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the Self Mode of Application Process?",
                "content": [
                    {
                        "text": [
                            "\nSelf Mode option of the application process allows the customers to apply for the Personal Loan by filling the complete application form and uploading the required documents online. After submission of application process through self-mode, application instantaneously moves for credit appraisal thus reducing the turn around time(TAT) for the customer.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the Assisted Mode of Application Process?",
                "content": [
                    {
                        "text": [
                            "\nAssisted Mode of application process offers Customer convenience of having Loan Officer for form filling, document collection and resolving of queries/doubts. In this mode, our Loan Officer will visit you and complete the process of application.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the benefits of applying through Self Mode?",
                "content": [
                    {
                        "text": [
                            "\nIf you apply through Self Mode, You will get ₹ 1000 discount on the Processing Fee, and Your loan disburses faster because you don’t have to wait for our Loan officer to visit and complete the application process.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How can I check the status of my Loan application?",
                "content": [
                    {
                        "text": [
                            "\nYou can check your status by clicking on Track your Application button on our website. You can also call our customer care number and provide your application reference number and mobile number to know the status of your loan.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How is having a higher credit score beneficial?",
                "content": [
                    {
                        "text": [
                            "\nA higher credit score indicates that you have a good track record concerning loans that you have borrowed in the past. Maintaining a credit score of 700 and above is always good. Ujjivan offers up to 1 % interest waiver for CIBIL score >700.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the key steps in the loan approval process?",
                "content": [
                    {
                        "text": [
                            "\nFollowing are the key steps involved for availing Personal Loan:\n\nApplication\nDocumentation\nVerification\nSanctioning and Processing of the loan\nDisbursement\n\nSubmitting a complete and valid set of documents is the most important step for faster loan amount disbursement. To avoid delays in loan processing and disbursement, do keep all necessary documents ready.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What would be my installment payment date?",
                "content": [
                    {
                        "text": [
                            "\nYou can select the repayment date of your personal out of the options 1st, 5th, and 10th. The repayment once selected cannot be changed.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How can I update my mailing address, mobile no, and email-id registered under my loan account?",
                "content": [
                    {
                        "text": [
                            "\nPlease submit a written request by visiting our branch for updating your details.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How do I get my loan statements, repayment schedule and Pre closure projection?",
                "content": [
                    {
                        "text": [
                            "\nYou can download all the above by logging into your internet banking/mobile banking. You can also call our Phone banking on 1800 208 2121 or visit our branch and place a request.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Once the loan has been repaid, will the Bank send me some confirmation?",
                "content": [
                    {
                        "text": [
                            "\nThe Bank issues a No Due Certificate (NOC) to the customer after the closure of the loan. The NOC will be made available on our Internet Banking and Mobile Banking platform for the customer to download.\n"
                        ]
                    }
                ]
            }
        ]
    }
}