{
    "url": "https://www.ujjivansfb.in/faq",
    "domain": "Home",
    "class": "Customer Care",
    "main_title": "Frequently Asked Questions (Fixed Deposit)",
    "subtitle": {
        "elements": [
            {
                "text": "What is a fixed deposit (FD)?",
                "content": [
                    {
                        "text": [
                            "\nFixed deposit (FD) is an account where a sum of money is kept with the Bank, whereby the Bank pays interest at a pre-determined rate for the time duration of the deposit. The rate of interest paid for fixed deposit varies according to amount and period.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the minimum deposit amount required for opening a fixed deposit account?",
                "content": [
                    {
                        "text": [
                            "\n\nThe minimum amount required for opening a fixed deposit account is\n`1,000,\nFor amounts more than\n`1,000,\nin multiples of\n`100.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the range of tenure for which I can open a fixed deposit account?",
                "content": [
                    {
                        "text": [
                            "\nYou can deposit money for as short a period as 7 days and up to 10 years.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the Interest rates offered by the Bank on fixed deposits?",
                "content": [
                    {
                        "text": [
                            "\n\nClick Here\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the penal rate of interest in case of premature withdrawal or part withdrawal?",
                "content": [
                    {
                        "text": [
                            "\nPlease refer to our penal rate of interest charges. Click here.\n"
                        ]
                    }
                ]
            },
            {
                "text": "At what frequency will I receive interest on my fixed deposit?",
                "content": [
                    {
                        "text": [
                            "\n\nFor periodic pay out fixed deposits with monthly/quarterly/half yearly/annually payouts, interest is calculated on simple interest basis.\nIn case of monthly payouts, interest is calculated on simple interest but at a discounted rate.\nFor fixed deposits with quarterly payout, interest is calculated for completed quarters and then for the balance period, interest is calculated for completed months and further for incomplete month on actual number of days.\nFor cumulative fixed deposits (pay out at end of term), interest is calculated on compounded interest basis quarterly on completion of exact quarters. For the broken period beyond completed quarters, simple interest is calculated on the cumulated deposit amount for remaining number of days.\n\n\n",
                            ""
                        ]
                    }
                ]
            },
            {
                "text": "Is TDS deductible on the interest earned on term deposits?",
                "content": [
                    {
                        "text": [
                            "\n\nFor Fixed Deposits, TDS is not applicable on the interest earned up to\n`10,000\nunder Section 194A. However, TDS will be applicable if the interest received or likely to be received, during the financial year, exceeds\n`10,000\n\nTax Deduction at Source (TDS) will be applicable on interest paid/ accrued on Recurring Deposits. In case the deposit holder does not want the Tax to be deducted at source, they may submit Form 15G / 15H (other than company, firm or co-operative society)/ Exemption Certificate under Section 197 (in case of all holders)/ or any other Tax Exemption Certificate with the Bank. Such form or tax exemption certificate has to be submitted every financial year for each fixed deposit held with the Bank. For further details contact the bank branch.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How do I open a Fixed Deposit?",
                "content": [
                    {
                        "text": [
                            "\n\nExisting Customers of the Bank savings account may book a fixed deposit by visiting the nearest Bank branch, logging into www.ujjivansfb.in, through Mobile and Net Banking or at Center Meetings (up to\n`5,000)\nNew Customers may also place a request by visiting the nearest Bank branch.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "Do Senior Citizens get any extra benefit on the Fixed Deposits?",
                "content": [
                    {
                        "text": [
                            "\nYes, Senior Citizens gain an additional 0.50% rate of interest.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can I redeem my fixed deposit before the original term?",
                "content": [
                    {
                        "text": [
                            "\nYes, fixed deposit can be closed before the original term of the fixed deposit by submitting fixed deposit receipt at the bank branch. Interest calculation will be as per the terms and conditions. For further details contact the bank branch.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How do I close the deposit before maturity?",
                "content": [
                    {
                        "text": [
                            "\nFixed deposit can be closed before maturity through the bank branch. Final amount paid will be calculated according to terms and conditions for deposit.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can I obtain a loan from the Bank on the security of my fixed deposit?",
                "content": [
                    {
                        "text": [
                            "\nYes, loan facility is available up to 80% of principal and accrued interest. You can walk into any of our branches for more information.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Is there any auto renewal facility available on fixed deposits?",
                "content": [
                    {
                        "text": [
                            "\nYes, you can choose an auto renewal facility at the time of opening the fixed deposit. Auto renewal allows your fixed deposit to get renewed automatically for the same period as the original deposit.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the options available for auto renewal?",
                "content": [
                    {
                        "text": [
                            "\nAuto Renewal has three options to renew your\n(i)  Principal only\n(ii)    Interest only and\n(iii)   Both Principal and Interest.\nYou can also opt out from auto renewal.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How do I redeem my fixed deposit?",
                "content": [
                    {
                        "text": [
                            "\nAfter maturity of your fixed deposit, you can walk into any of the Bank branch across the country and claim your deposit by furnishing your fixed deposit details.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Is there a nomination facility?",
                "content": [
                    {
                        "text": [
                            "\nYes, there is a nomination facility on the fixed deposit account\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is reinvestment or cumulative fixed deposit?",
                "content": [
                    {
                        "text": [
                            "\nA cumulative fixed deposit account will be offered to customers where an amount is kept with the bank and the bank pays interest at the time of maturity. Interest is calculated on compounded interest basis quarterly and it is reinvested. The rate of interest paid for fixed deposit will vary according to tenure and amount. Maturity of these fixed deposits ranges from 6 months to 10 years.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Is Overdraft against fixed deposit facility available?",
                "content": [
                    {
                        "text": [
                            "\nYes, you can avail over draft facility against fixed deposit. Please contact the Bank branch for further information.\n"
                        ]
                    }
                ]
            }
        ]
    }
}