{
    "url": "https://www.ujjivansfb.in/faq",
    "domain": "Home",
    "class": "Customer Care",
    "main_title": "Frequently Asked Questions (Business Net Banking)",
    "subtitle": {
        "elements": [
            {
                "text": "What is Ujjivan Business Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nBusiness Net Banking is an online portal specially designed for business and corporates who are customers of Ujjivan Small Finance Bank.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How is Business Net Banking different from Personal Net Banking?",
                "content": [
                    {
                        "text": [
                            "\n\nAllows authorized signatories/account holders to designate individuals (Business Net Banking user) to initiate and/or authorize financial and non-financial transactions.\nDefined transaction workflow through maker-checker concept and Transaction Authorisation Matrix through 2 levels of Authorisation. Ex. A Fund transfer initiated by an Officer (Role-Maker) to be Authorised by his Manager (Role-Checker) at 1st level and again authorised by the CFO (Role-Maker Checker) of the company at 2nd level. Customers can opt for Straight through transactions (supported by 2 factor authentication)  provided the mode of operation is singly by submitting the required supporting documents (authorisation letter, declaration).\nUsers can define per transaction limit in the Business Net Banking form for every user. There is no per day limit in Business Net Banking.\nBusiness Net Banking allows the user to perform multiple transactions through File upload functionality which can incorporate transactions upto 9000+ transactions (NEFT, RTGS, Internal Fund Transfer)\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the fund transfer limits?",
                "content": [
                    {
                        "text": [
                            "\nThe per transaction limit will be as defined in the Business Net Banking form. There is no per day limit.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Who is eligible for Ujjivan Business Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nAny non-individual entity having Current/Savings Account with Ujjivan can opt for Business Net Banking\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is a Business Net Banking form?",
                "content": [
                    {
                        "text": [
                            "\nBusiness Net Banking form is an on-boarding form which needs to be filled to define the user profile, roles, and access rights, account linkage etc. The form needs to be signed by the Authorised Signatory(s) of the account on each page of the Business Net Banking form along with seal (if applicable).  It needs to be submitted along with the applicable supporting documents.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Who is a Business Net banking User?",
                "content": [
                    {
                        "text": [
                            "\n\nCustomer appointed individual who can operate Business Net Banking on behalf of the customer and perform activities on the linked account as per the user role defined in the on-boarding form.\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the types of access/role is provided to the users of the Business Net Banking facility?",
                "content": [
                    {
                        "text": [
                            "\n\n(V) Viewer - The user has ONLY view rights and cannot initiate/authorise transactions\n(M) Initiator - The user can view and initiate transactions, but cannot authorize them\n(C) Authoriser - The user can view and authorize transactions, but cannot initiate them\n(B) Initiator and Authoriser - The user can view, initiate and authorize transactions\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What documents should I submit to get access for Business Net Banking?",
                "content": [
                    {
                        "text": [
                            "\n\n\n\n\n\n\n\nApplicable Supporting Documents\n\n\n\nConstitution Type\nBusiness Net Banking Form\nPOA for Authorised Signatory and  User*\nAuthorisation Letter\nBoard Resolution\nLLP Resolution\nHUF Letter**\nTASC Resolution\n\n\nPartnership\nY\nY (IF PARTNER is not User)\nY (IF PARTNER is both Authorised signatory and User)\n\n\n\n\n\n\nPublic Ltd. Company\nY\n\n\nY\n\n\n\n\n\nPrivate Ltd. Company\nY\n\n\nY\n\n\n\n\n\nOne Person Company\nY\n\n\nY\n\n\n\n\n\nLimited Liability Partnership (LLP)\nY\n\n\n\nY\n\n\n\n\nHindu Undivided Family (HUF)\nY\n\n\n\n\nY\n\n\n\nTASC\nY\n\n\n\n\n\nY\n\n\n\n*POA to be signed by all the partners in case of “Partnership”\n**HUF Letter to be signed by all the coparceners, excluding minors\n\n\n\n\n",
                            "\n\n\n\n\n\n\nApplicable Supporting Documents\n\n\n\nConstitution Type\nBusiness Net Banking Form\nPOA for Authorised Signatory and  User*\nAuthorisation Letter\nBoard Resolution\nLLP Resolution\nHUF Letter**\nTASC Resolution\n\n\nPartnership\nY\nY (IF PARTNER is not User)\nY (IF PARTNER is both Authorised signatory and User)\n\n\n\n\n\n\nPublic Ltd. Company\nY\n\n\nY\n\n\n\n\n\nPrivate Ltd. Company\nY\n\n\nY\n\n\n\n\n\nOne Person Company\nY\n\n\nY\n\n\n\n\n\nLimited Liability Partnership (LLP)\nY\n\n\n\nY\n\n\n\n\nHindu Undivided Family (HUF)\nY\n\n\n\n\nY\n\n\n\nTASC\nY\n\n\n\n\n\nY\n\n\n\n*POA to be signed by all the partners in case of “Partnership”\n**HUF Letter to be signed by all the coparceners, excluding minors\n\n\n\n",
                            "\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "What is the format of the applicable supporting documents? Are there any templates to be followed?",
                "content": [
                    {
                        "text": [
                            "\nThe format of applicable supporting documents is available on the Ujjivan’s website. These documents are to be printed on letter head of the company/organisation (as applicable and mentioned in the document). All the details mentioned in the supporting document template needs to be strictly followed mandatorily. Any missing detail or change in the format can lead to rejection of the request. If you have your own format of the supporting document, then all the details that has been mentioned in the document templates, needs to be incorporated.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How will I know when my Business Net Banking request has been processed?",
                "content": [
                    {
                        "text": [
                            "\nOnce the documents are submitted, your request will be processed in 10 working days subject to fulfilment of document scrutiny/verification by the bank. Users will receive an E-mail with details of your Corporate ID, User ID, and Login/Transaction Password.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are Corporate ID, User ID, Login Password and Transaction Password?",
                "content": [
                    {
                        "text": [
                            "\n\nCorporate ID – Unique identifier assigned by the bank to identify the Business Net Banking using corporates. Corporate ID is the 1st credential required to log into Business Net Banking portal.\nUser ID: Unique identifier assigned by the bank to every user. User ID is the 2nd credential required to log into Business Net Banking portal. It is case sensitive\nLogin Password: It is the 3rd credential required to log into Business Net Banking. It is case sensitive.\nTransaction Password: This is required for authorising transactions along with OTP. This password will be applicable to users who can authorise transactions i.e. Authorisers, Initiator-Authorisers. It is case sensitive\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "If the documents submitted by me was rejected due to some details entered was wrong, then do I have to re-submit fresh form and supporting documents again?",
                "content": [
                    {
                        "text": [
                            "\nIf the form was rejected due to some missing details then, you may edit the submitted form again by entering the details. The authorised signatory will have to re-sign on the Business Net Banking form accepting the addition of details on each page of the Business Net Banking form. Fresh supporting documents need not be submitted provided the there is no discrepancy between the supporting document, authorised signatory details and Business Net Banking form.\n"
                        ]
                    }
                ]
            },
            {
                "text": "For any modification in users do I need to submit supporting document?",
                "content": [
                    {
                        "text": [
                            "\nFor any kind of modification in existing  user, like updating mobile number, email ID, user role, limits, department, authorisation matrix (with existing users) and blocking users, only new Business Net Banking form is required along with authorised signatory(s) signature and company seal (as applicable) on each page. For addition of new account(s) and User(s), new Business Net Banking form and supporting document is required mentioning the required details.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the types of limits that can be set in Business Net Banking?",
                "content": [
                    {
                        "text": [
                            "\n\nInitiating Limit per Transaction:\nMaximum Sum of amount (INR) which can be initiated by a user at once who can initiate transactions (M/B)\n\n\nAuthorising Limit per Transaction:\nMaximum Sum of amount (INR) which can be authorised by a user at once who can authorise transactions (C/B)\n\n\nLimits will be applicable for the below:\n\n\n\n\n-Fund Transfer:\n\nOwn account/within Ujjivan/ Multiple and Single/recurring Fund Transfer/NEFT/IMPS/RTGS\n\n\nBill Payment and Recharge:\n\nElectricity/DTH/Water/Broadband/Prepaid/Postpaid/Gas etc.\n\n\n\n-File Upload:\nPer file (transaction) limit for Cumulative Amount in a File having bulk multiple beneficiary payments by Internal fund transfer/NEFT/RTGS that can be uploaded in Business Net Banking for processing\n\n\n",
                            "\n\n\n-Fund Transfer:\n\nOwn account/within Ujjivan/ Multiple and Single/recurring Fund Transfer/NEFT/IMPS/RTGS\n\n\nBill Payment and Recharge:\n\nElectricity/DTH/Water/Broadband/Prepaid/Postpaid/Gas etc.\n\n\n\n-File Upload:\nPer file (transaction) limit for Cumulative Amount in a File having bulk multiple beneficiary payments by Internal fund transfer/NEFT/RTGS that can be uploaded in Business Net Banking for processing\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "Is mobile number and email ID mandatory to be mentioned in the Business Net Banking form?",
                "content": [
                    {
                        "text": [
                            "\nYes. Email ID of the user will be used to send Corporate ID, User ID and system generated login/transaction password. After entering 1st time login password, the system will prompt the Business Net Banking user to change his login/transaction password post OTP verification, which will be sent to user’s registered mobile number. OTP sent to user’s registered mobile number will also be used as a factor of authentication while authorising transaction.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Is Maker-Checker offered in Ujjivan Business Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nYes. Ujjivan Business Net Banking supports maker-checker concept for greater control to the customers. Different users can be mentioned as maker and checker for a transaction.\n"
                        ]
                    }
                ]
            },
            {
                "text": "How many level of authorisation is supported in Ujjivan Business Net Banking?",
                "content": [
                    {
                        "text": [
                            "\nDual level of authorisation can be opted for the customers for any type of transactions which are mentioned in the Business Net Banking form. For example, if a transaction initiated by a Business Net Banking user who is an Initiator (M/B) needs to be approved by Business Net Banking user at 1st level and 2nd Business Net Banking user at 2nd level, then the number of approvers in this case will be 2 i.e. one at 1st level and second at 2nd level. A transaction initiated by this Business Net Banking user will have to be approved by 2 Business Net Banking users with Authoriser role (C/B). The transaction will flow from initiator to 1st level authoriser and then 2nd level of authoriser. If no transaction is selected for dual authorisation, then the transaction will be applicable for single level of authorisation i.e. the transaction will flow from initiator and then to 1st level of authoriser. The authorisation matrix to be defined accordingly in the Business Net Banking form. The number of Business Net Banking users at any level should mandatorily be one Business Net Banking user and can also have group of Business Net Banking users/Department which is optional.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What all kind of fund transfers are supported in Business Net Banking",
                "content": [
                    {
                        "text": [
                            "\nNEFT, RTGS, IMPS and Internal Fund Transfer. All these can be used for single transfer and multi-fund transfer. For file upload, RTGS, NEFT and Internal Funds Transfer (IFT) can be used.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Can we schedule one-time/recurring fund transfer?",
                "content": [
                    {
                        "text": [
                            "\nYes. You can schedule fund transfer (Internal fund transfer/NEFT/RTGS). Based on the date of execution and frequency the transactions will be executed.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Within how many days should a transaction be approved by authorizer?",
                "content": [
                    {
                        "text": [
                            "\n15 days.\n"
                        ]
                    }
                ]
            },
            {
                "text": "When will be my login/transaction password will get expired?",
                "content": [
                    {
                        "text": [
                            "\nAfter 180 Days\n"
                        ]
                    }
                ]
            },
            {
                "text": "I have forgotten my login/transaction password, how can I get new password?",
                "content": [
                    {
                        "text": [
                            "\nYou can use click on “Forgot Password” to reset your login/transaction password. You will receive system generated credentials on the registered email id.\n"
                        ]
                    }
                ]
            },
            {
                "text": "What are the browser requirements for Ujjivan Business Net Banking?",
                "content": [
                    {
                        "text": [
                            "\n\nInternet explorer 10 or above\nGoogle chrome 23 or above\nMozilla Firefox 13 or above\nApple safari 5 or above\nOpera 12 or above\n\n"
                        ]
                    }
                ]
            },
            {
                "text": "Within how much time Bill Payments and Recharges should be authorised?",
                "content": [
                    {
                        "text": [
                            "\nAny bill payment/recharge initiated to be authorised within 24 hours of initiation. Otherwise that transaction will be expired and will fail.\n"
                        ]
                    }
                ]
            },
            {
                "text": "Where can I find the uploaded file which has been authorised and processed?",
                "content": [
                    {
                        "text": [
                            "\nThe files which was successfully authorised and processed will be available in File Upload View Bulk Upload File Status. There you can select Upload Date. File name will be as per below naming standards:\n\nFile starting with NFT will have only NEFT transactions.\nFile starting with RTG will have only RTGS transactions.\nFile starting with IFT will have only Internal Fund Transfers.\n\n"
                        ]
                    }
                ]
            }
        ]
    }
}